[Survived] BlockStatement
src/domain/validations.ts:3:59
 import { Transaction, TransactionStatus, TransactionType } from '../models';
 
-export function roundToTwoDecimals(value: number): number {
-  return Math.round(value * 100) / 100;
-}
+export function roundToTwoDecimals(value: number): number {}
 
 export class ValidationError extends Error {

[Survived] ArithmeticOperator
src/domain/validations.ts:4:10
 import { Transaction, TransactionStatus, TransactionType } from '../models';
 
 export function roundToTwoDecimals(value: number): number {
-  return Math.round(value * 100) / 100;
+  return Math.round(value * 100) * 100;
 }
 

[Survived] ArithmeticOperator
src/domain/validations.ts:4:21
 import { Transaction, TransactionStatus, TransactionType } from '../models';
 
 export function roundToTwoDecimals(value: number): number {
-  return Math.round(value * 100) / 100;
+  return Math.round(value / 100) / 100;
 }
 

[Killed] BlockStatement
src/domain/validations.ts:8:32
 }
 
 export class ValidationError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'ValidationError';
-  }
+  constructor(message: string) {}
 }
 
killedBy: Validations validateAmountNotNegative should throw error when amount is negative
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      62 |       stryCov_9fa48("3");

[Survived] StringLiteral
src/domain/validations.ts:10:17
 export class ValidationError extends Error {
   constructor(message: string) {
     super(message);
-    this.name = 'ValidationError';
+    this.name = "";
   }
 }

[Killed] BlockStatement
src/domain/validations.ts:14:65
   }
 }
 
-export function validateAmountNotNegative(amount: number): void {
-  if (amount < 0) {
-    throw new ValidationError('Transaction amount cannot be negative');
-  }
-}
+export function validateAmountNotNegative(amount: number): void {}
 
 export function validateDate(date: Date): void {
killedBy: Validations validateAmountNotNegative should throw error when amount is negative
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:15:19
 }
 
 export function validateAmountNotNegative(amount: number): void {
-  if (amount < 0) {
-    throw new ValidationError('Transaction amount cannot be negative');
-  }
+  if (amount < 0) {}
 }
 
killedBy: Validations validateAmountNotNegative should throw error when amount is negative
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
src/domain/validations.ts:15:7
 }
 
 export function validateAmountNotNegative(amount: number): void {
-  if (amount < 0) {
+  if (amount <= 0) {
     throw new ValidationError('Transaction amount cannot be negative');
   }
killedBy: Validations validateAmountNotNegative should not throw error when amount is zero
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Transaction amount cannot be negative"

      76 |       } else {
      77 |         stryCov_9fa48("10");
    > 78 |         throw new ValidationError(stryMutAct_9fa48("11") ? "" : (stryCov_9fa48("11"), 'Transaction amount cannot be negative'));

[Killed] BlockStatement
src/domain/validations.ts:20:48
   }
 }
 
-export function validateDate(date: Date): void {
-  if (!(date instanceof Date) || isNaN(date.getTime())) {
-    throw new ValidationError('Invalid date format');
-  }
-}
+export function validateDate(date: Date): void {}
 
 export function validateRefundHasValidPayment(
killedBy: Validations validateDate should throw error when date is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:21:7
 }
 
 export function validateDate(date: Date): void {
-  if (!(date instanceof Date) || isNaN(date.getTime())) {
+  if (false) {
     throw new ValidationError('Invalid date format');
   }
killedBy: Validations validateDate should throw error when date is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] LogicalOperator
src/domain/validations.ts:21:7
 }
 
 export function validateDate(date: Date): void {
-  if (!(date instanceof Date) || isNaN(date.getTime())) {
+  if (!(date instanceof Date) && isNaN(date.getTime())) {
     throw new ValidationError('Invalid date format');
   }
killedBy: Validations validateDate should throw error when date is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] StringLiteral
src/domain/validations.ts:22:31
 
 export function validateDate(date: Date): void {
   if (!(date instanceof Date) || isNaN(date.getTime())) {
-    throw new ValidationError('Invalid date format');
+    throw new ValidationError("");
   }
 }
killedBy: Validations validateDate should throw error when date is invalid
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid date format"
Received message:   ""

      91 |       } else {
      92 |         stryCov_9fa48("17");
    > 93 |         throw new ValidationError(stryMutAct_9fa48("18") ? "" : (stryCov_9fa48("18"), 'Invalid date format'));

[Killed] BlockStatement
src/domain/validations.ts:29:9
 export function validateRefundHasValidPayment(
   refund: Transaction,
   payments: Map<string, Transaction>
-): void {
-  if (!refund.originalTransactionId) {
-    throw new ValidationError('Refund must have an originalTransactionId');
-  }
-
-  const originalTransaction = payments.get(refund.originalTransactionId);
-
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `Refund references non-existent payment: ${refund.originalTransactionId}`
-    );
-  }
-
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
-    throw new ValidationError(
-      `Refund must reference a payment, not ${originalTransaction.type}`
-    );
-  }
-}
+): void {}
 
 export function validateChargebackHasValidApprovedPayment(
killedBy: Validations validateRefundHasValidPayment should throw error when refund has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:30:38
   refund: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!refund.originalTransactionId) {
-    throw new ValidationError('Refund must have an originalTransactionId');
-  }
+  if (!refund.originalTransactionId) {}
 
   const originalTransaction = payments.get(refund.originalTransactionId);
killedBy: Validations validateRefundHasValidPayment should throw error when refund has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must have an originalTransactionId"
Received message:   "Refund references non-existent payment: undefined"

      115 |       } else {
      116 |         stryCov_9fa48("28");
    > 117 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${refund.orig

[Killed] BooleanLiteral
src/domain/validations.ts:30:7
   refund: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!refund.originalTransactionId) {
+  if (refund.originalTransactionId) {
     throw new ValidationError('Refund must have an originalTransactionId');
   }
killedBy: Validations validateRefundHasValidPayment should throw error when refund has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must have an originalTransactionId"
Received message:   "Refund references non-existent payment: undefined"

      115 |       } else {
      116 |         stryCov_9fa48("28");
    > 117 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${refund.orig

[Killed] ConditionalExpression
src/domain/validations.ts:36:7
 
   const originalTransaction = payments.get(refund.originalTransactionId);
 
-  if (!originalTransaction) {
+  if (true) {
     throw new ValidationError(
       `Refund references non-existent payment: ${refund.originalTransactionId}`
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must reference a payment, not chargeback"
Received message:   "Refund references non-existent payment: chargeback-1"

      115 |       } else {
      116 |         stryCov_9fa48("28");
    > 117 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${re

[Killed] ConditionalExpression
src/domain/validations.ts:36:7
 
   const originalTransaction = payments.get(refund.originalTransactionId);
 
-  if (!originalTransaction) {
+  if (false) {
     throw new ValidationError(
       `Refund references non-existent payment: ${refund.originalTransactionId}`
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-existent payment
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      118 |       }

[Killed] BlockStatement
src/domain/validations.ts:42:61
     );
   }
 
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
-    throw new ValidationError(
-      `Refund must reference a payment, not ${originalTransaction.type}`
-    );
-  }
+  if (originalTransaction.type !== TransactionType.PAYMENT) {}
 }
 
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:42:7
     );
   }
 
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
+  if (false) {
     throw new ValidationError(
       `Refund must reference a payment, not ${originalTransaction.type}`
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] StringLiteral
src/domain/validations.ts:44:7
 
   if (originalTransaction.type !== TransactionType.PAYMENT) {
     throw new ValidationError(
-      `Refund must reference a payment, not ${originalTransaction.type}`
+      ``
     );
   }
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must reference a payment, not chargeback"
Received message:   ""

      123 |       } else {
      124 |         stryCov_9fa48("33");
    > 125 |         throw new ValidationError(stryMutAct_9fa48("34") ? `` : (stryCov_9fa48("34"), `Refund must reference a payment, not ${originalTransaction.type}`));

[Killed] BlockStatement
src/domain/validations.ts:52:9
 export function validateChargebackHasValidApprovedPayment(
   chargeback: Transaction,
   payments: Map<string, Transaction>
-): void {
-  if (!chargeback.originalTransactionId) {
-    throw new ValidationError('Chargeback must have an originalTransactionId');
-  }
-
-  const originalTransaction = payments.get(chargeback.originalTransactionId);
-
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `Chargeback references non-existent payment: ${chargeback.originalTransactionId}`
-    );
-  }
-
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
-    throw new ValidationError(
-      `Chargeback must reference a payment, not ${originalTransaction.type}`
-    );
-  }
-
-  if (originalTransaction.status !== TransactionStatus.APPROVED) {
-    throw new ValidationError(
-      `Chargeback must reference an approved payment, got: ${originalTransaction.status}`
-    );
-  }
-}
+): void {}
 
 export function validateChargebackReversedHasValidChargeback(
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:53:7
   chargeback: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!chargeback.originalTransactionId) {
+  if (true) {
     throw new ValidationError('Chargeback must have an originalTransactionId');
   }
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references non-existent payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback references non-existent payment: non-existent"
Received message:   "Chargeback must have an originalTransactionId"

      138 |       } else {
      139 |         stryCov_9fa48("39");
    > 140 |         throw new ValidationError(stryMutAct_9fa48("40") ? "" : (stryCov_9fa48("40"), 'Chargeback must have an originalTransactio

[Killed] BooleanLiteral
src/domain/validations.ts:53:7
   chargeback: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!chargeback.originalTransactionId) {
+  if (chargeback.originalTransactionId) {
     throw new ValidationError('Chargeback must have an originalTransactionId');
   }
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback must have an originalTransactionId"
Received message:   "Chargeback references non-existent payment: undefined"

      147 |       } else {
      148 |         stryCov_9fa48("44");
    > 149 |         throw new ValidationError(stryMutAct_9fa48("45") ? `` : (stryCov_9fa48("45"), `Chargeback references non-existent payment: $

[Killed] StringLiteral
src/domain/validations.ts:54:31
   payments: Map<string, Transaction>
 ): void {
   if (!chargeback.originalTransactionId) {
-    throw new ValidationError('Chargeback must have an originalTransactionId');
+    throw new ValidationError("");
   }
 
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback must have an originalTransactionId"
Received message:   ""

      138 |       } else {
      139 |         stryCov_9fa48("39");
    > 140 |         throw new ValidationError(stryMutAct_9fa48("40") ? "" : (stryCov_9fa48("40"), 'Chargeback must have an originalTransactionId'));

[Killed] BlockStatement
src/domain/validations.ts:59:29
 
   const originalTransaction = payments.get(chargeback.originalTransactionId);
 
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `Chargeback references non-existent payment: ${chargeback.originalTransactionId}`
-    );
-  }
+  if (!originalTransaction) {}
 
   if (originalTransaction.type !== TransactionType.PAYMENT) {
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references non-existent payment
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      150 |       }

[Killed] EqualityOperator
src/domain/validations.ts:65:7
     );
   }
 
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
+  if (originalTransaction.type === TransactionType.PAYMENT) {
     throw new ValidationError(
       `Chargeback must reference a payment, not ${originalTransaction.type}`
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references pending payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback must reference an approved payment"
Received message:   "Chargeback must reference a payment, not payment"

      155 |       } else {
      156 |         stryCov_9fa48("49");
    > 157 |         throw new ValidationError(stryMutAct_9fa48("50") ? `` : (stryCov_9fa48("50"), `Chargeback must reference a payment, not ${origina

[Killed] ConditionalExpression
src/domain/validations.ts:65:7
     );
   }
 
-  if (originalTransaction.type !== TransactionType.PAYMENT) {
+  if (true) {
     throw new ValidationError(
       `Chargeback must reference a payment, not ${originalTransaction.type}`
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references pending payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback must reference an approved payment"
Received message:   "Chargeback must reference a payment, not payment"

      155 |       } else {
      156 |         stryCov_9fa48("49");
    > 157 |         throw new ValidationError(stryMutAct_9fa48("50") ? `` : (stryCov_9fa48("50"), `Chargeback must reference a payment, not ${origina

[Killed] ConditionalExpression
src/domain/validations.ts:71:7
     );
   }
 
-  if (originalTransaction.status !== TransactionStatus.APPROVED) {
+  if (true) {
     throw new ValidationError(
       `Chargeback must reference an approved payment, got: ${originalTransaction.status}`
killedBy: Validations validateChargebackHasValidApprovedPayment should not throw error when chargeback has valid approved payment reference
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Chargeback must reference an approved payment, got: approved"

      163 |       } else {
      164 |         stryCov_9fa48("54");
    > 165 |         throw new ValidationError(stryMutAct_9fa48("55") ? `` : (stryCov_9fa48("55"), `Chargeback must reference an approved payment, got: ${originalTransaction.status}`

[Killed] ConditionalExpression
src/domain/validations.ts:71:7
     );
   }
 
-  if (originalTransaction.status !== TransactionStatus.APPROVED) {
+  if (false) {
     throw new ValidationError(
       `Chargeback must reference an approved payment, got: ${originalTransaction.status}`
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references pending payment
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:81:9
 export function validateChargebackReversedHasValidChargeback(
   chargebackReversed: Transaction,
   allTransactions: Map<string, Transaction>
-): void {
-  if (!chargebackReversed.originalTransactionId) {
-    throw new ValidationError('ChargebackReversed must have an originalTransactionId');
-  }
-
-  const originalTransaction = allTransactions.get(chargebackReversed.originalTransactionId);
-
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `ChargebackReversed references non-existent chargeback: ${chargebackReversed.originalTransactionId}`
-    );
-  }
-
-  if (originalTransaction.type !== TransactionType.CHARGEBACK) {
-    throw new ValidationError(
-      `ChargebackReversed must reference a chargeback, not ${originalTransaction.type}`
-    );
-  }
-}
+): void {}
 
 export function validateRefundNotExceedsOriginal(
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BooleanLiteral
src/domain/validations.ts:82:7
   chargebackReversed: Transaction,
   allTransactions: Map<string, Transaction>
 ): void {
-  if (!chargebackReversed.originalTransactionId) {
+  if (chargebackReversed.originalTransactionId) {
     throw new ValidationError('ChargebackReversed must have an originalTransactionId');
   }
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "ChargebackReversed must have an originalTransactionId"
Received message:   "ChargebackReversed references non-existent chargeback: undefined"

      187 |       } else {
      188 |         stryCov_9fa48("65");
    > 189 |         throw new ValidationError(stryMutAct_9fa48("66") ? `` : (stryCov_9fa48("66"), `ChargebackReversed referen

[Killed] BlockStatement
src/domain/validations.ts:82:50
   chargebackReversed: Transaction,
   allTransactions: Map<string, Transaction>
 ): void {
-  if (!chargebackReversed.originalTransactionId) {
-    throw new ValidationError('ChargebackReversed must have an originalTransactionId');
-  }
+  if (!chargebackReversed.originalTransactionId) {}
 
   const originalTransaction = allTransactions.get(chargebackReversed.originalTransactionId);
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "ChargebackReversed must have an originalTransactionId"
Received message:   "ChargebackReversed references non-existent chargeback: undefined"

      187 |       } else {
      188 |         stryCov_9fa48("65");
    > 189 |         throw new ValidationError(stryMutAct_9fa48("66") ? `` : (stryCov_9fa48("66"), `ChargebackReversed referen

[Killed] BooleanLiteral
src/domain/validations.ts:88:7
 
   const originalTransaction = allTransactions.get(chargebackReversed.originalTransactionId);
 
-  if (!originalTransaction) {
+  if (originalTransaction) {
     throw new ValidationError(
       `ChargebackReversed references non-existent chargeback: ${chargebackReversed.originalTransactionId}`
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed references non-existent chargeback
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      190 |       }

[Killed] BlockStatement
src/domain/validations.ts:88:29
 
   const originalTransaction = allTransactions.get(chargebackReversed.originalTransactionId);
 
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `ChargebackReversed references non-existent chargeback: ${chargebackReversed.originalTransactionId}`
-    );
-  }
+  if (!originalTransaction) {}
 
   if (originalTransaction.type !== TransactionType.CHARGEBACK) {
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed references non-existent chargeback
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      190 |       }

[Killed] EqualityOperator
src/domain/validations.ts:94:7
     );
   }
 
-  if (originalTransaction.type !== TransactionType.CHARGEBACK) {
+  if (originalTransaction.type === TransactionType.CHARGEBACK) {
     throw new ValidationError(
       `ChargebackReversed must reference a chargeback, not ${originalTransaction.type}`
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed references payment instead of chargeback
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:94:64
     );
   }
 
-  if (originalTransaction.type !== TransactionType.CHARGEBACK) {
-    throw new ValidationError(
-      `ChargebackReversed must reference a chargeback, not ${originalTransaction.type}`
-    );
-  }
+  if (originalTransaction.type !== TransactionType.CHARGEBACK) {}
 }
 
killedBy: Validations validateChargebackReversedHasValidChargeback should throw error when chargebackReversed references payment instead of chargeback
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:104:9
 export function validateRefundNotExceedsOriginal(
   refundAmount: number,
   originalAmount: number
-): void {
-  if (refundAmount > originalAmount) {
-    throw new ValidationError(
-      `Refund amount (${refundAmount}) cannot exceed original payment amount (${originalAmount})`
-    );
-  }
-}
+): void {}
 
 export function validateTransaction(
killedBy: Validations validateRefundNotExceedsOriginal should throw error when refund exceeds original amount
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:105:7
   refundAmount: number,
   originalAmount: number
 ): void {
-  if (refundAmount > originalAmount) {
+  if (true) {
     throw new ValidationError(
       `Refund amount (${refundAmount}) cannot exceed original payment amount (${originalAmount})`
killedBy: Validations validateRefundNotExceedsOriginal should not throw error when refund equals original amount
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Refund amount (100) cannot exceed original payment amount (100)"

      210 |       } else {
      211 |         stryCov_9fa48("77");
    > 212 |         throw new ValidationError(stryMutAct_9fa48("78") ? `` : (stryCov_9fa48("78"), `Refund amount (${refundAmount}) cannot exceed original payment amount (${origin

[Killed] EqualityOperator
src/domain/validations.ts:105:7
   refundAmount: number,
   originalAmount: number
 ): void {
-  if (refundAmount > originalAmount) {
+  if (refundAmount <= originalAmount) {
     throw new ValidationError(
       `Refund amount (${refundAmount}) cannot exceed original payment amount (${originalAmount})`
killedBy: Validations validateRefundNotExceedsOriginal should throw error when refund exceeds original amount
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:116:9
   transaction: Transaction,
   allPayments?: Map<string, Transaction>,
   allTransactions?: Map<string, Transaction>
-): void {
-  validateAmountNotNegative(transaction.amount);
-
-  validateDate(transaction.createdAt);
-
-  if (allPayments) {
-    if (transaction.type === TransactionType.REFUND) {
-      validateRefundHasValidPayment(transaction, allPayments);
-    }
-
-    if (transaction.type === TransactionType.CHARGEBACK) {
-      validateChargebackHasValidApprovedPayment(transaction, allPayments);
-    }
-  }
-
-  if (allTransactions && transaction.type === TransactionType.CHARGEBACK_REVERSED) {
-    validateChargebackReversedHasValidChargeback(transaction, allTransactions);
-  }
-}
+): void {}
 
killedBy: Validations validateTransaction should throw error when transaction has negative amount
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:121:7
 
   validateDate(transaction.createdAt);
 
-  if (allPayments) {
+  if (false) {
     if (transaction.type === TransactionType.REFUND) {
       validateRefundHasValidPayment(transaction, allPayments);
killedBy: Validations validateTransaction should validate refund with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:121:20
 
   validateDate(transaction.createdAt);
 
-  if (allPayments) {
-    if (transaction.type === TransactionType.REFUND) {
-      validateRefundHasValidPayment(transaction, allPayments);
-    }
-
-    if (transaction.type === TransactionType.CHARGEBACK) {
-      validateChargebackHasValidApprovedPayment(transaction, allPayments);
-    }
-  }
+  if (allPayments) {}
 
   if (allTransactions && transaction.type === TransactionType.CHARGEBACK_REVERSED) {
killedBy: Validations validateTransaction should validate refund with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:122:9
   validateDate(transaction.createdAt);
 
   if (allPayments) {
-    if (transaction.type === TransactionType.REFUND) {
+    if (false) {
       validateRefundHasValidPayment(transaction, allPayments);
     }
killedBy: Validations validateTransaction should validate refund with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw
