[Killed] BlockStatement
src/domain/validations.ts:122:54
   validateDate(transaction.createdAt);
 
   if (allPayments) {
-    if (transaction.type === TransactionType.REFUND) {
-      validateRefundHasValidPayment(transaction, allPayments);
-    }
+    if (transaction.type === TransactionType.REFUND) {}
 
     if (transaction.type === TransactionType.CHARGEBACK) {
killedBy: Validations validateTransaction should validate refund with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] BlockStatement
src/domain/validations.ts:126:58
       validateRefundHasValidPayment(transaction, allPayments);
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK) {
-      validateChargebackHasValidApprovedPayment(transaction, allPayments);
-    }
+    if (transaction.type === TransactionType.CHARGEBACK) {}
   }
 
killedBy: Validations validateTransaction should validate chargeback with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
src/domain/validations.ts:126:9
       validateRefundHasValidPayment(transaction, allPayments);
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK) {
+    if (transaction.type !== TransactionType.CHARGEBACK) {
       validateChargebackHasValidApprovedPayment(transaction, allPayments);
     }
killedBy: Validations validateTransaction should validate chargeback with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] LogicalOperator
src/domain/validations.ts:131:7
     }
   }
 
-  if (allTransactions && transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+  if (allTransactions || transaction.type === TransactionType.CHARGEBACK_REVERSED) {
     validateChargebackReversedHasValidChargeback(transaction, allTransactions);
   }
killedBy: Validations validateTransaction should not throw error for valid chargebackReversed transaction
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'get')"

      181 |       }
      182 |     }
    > 183 |     const originalTransaction = allTransactions.get(chargebackReversed.originalTransactionId);

[Killed] EqualityOperator
src/domain/validations.ts:131:26
     }
   }
 
-  if (allTransactions && transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+  if (allTransactions && transaction.type !== TransactionType.CHARGEBACK_REVERSED) {
     validateChargebackReversedHasValidChargeback(transaction, allTransactions);
   }
killedBy: Validations validateTransaction should validate chargebackReversed with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw
