[Killed] BlockStatement
src/processor.ts:35:54
     const chargebackPenalties = new Map<string, number>();
     const merchantChargebackCounts = new Map<string, number>();
     const merchantApprovedPaymentCounts = new Map<string, number>();
-    for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
-        paymentMap.set(transaction.id, transaction);
-
-        if (transaction.status === TransactionStatus.APPROVED) {
-          const volume = volumeByMerchant.get(transaction.merchantId);
-          const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
-
-          const processed = processApprovedPayment(transaction, merchantVolume);
-          paymentFees.set(transaction.id, processed.fee);
-
-          const count = merchantApprovedPaymentCounts.get(transaction.merchantId) || 0;
-          merchantApprovedPaymentCounts.set(transaction.merchantId, count + 1);
-        }
-      }
-    }
+    for (const transaction of validatedTransactions) {}
 
     for (const transaction of validatedTransactions) {
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
src/processor.ts:36:11
     const merchantChargebackCounts = new Map<string, number>();
     const merchantApprovedPaymentCounts = new Map<string, number>();
     for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
+      if (false) {
         paymentMap.set(transaction.id, transaction);
 
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] BlockStatement
src/processor.ts:36:57
     const merchantChargebackCounts = new Map<string, number>();
     const merchantApprovedPaymentCounts = new Map<string, number>();
     for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
-        paymentMap.set(transaction.id, transaction);
-
-        if (transaction.status === TransactionStatus.APPROVED) {
-          const volume = volumeByMerchant.get(transaction.merchantId);
-          const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
-
-          const processed = processApprovedPayment(transaction, merchantVolume);
-          paymentFees.set(transaction.id, processed.fee);
-
-          const count = merchantApprovedPaymentCounts.get(transaction.merchantId) || 0;
-          merchantApprovedPaymentCounts.set(transaction.merchantId, count + 1);
-        }
-      }
+      if (transaction.type === TransactionType.PAYMENT) {}
     }
 
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] EqualityOperator
src/processor.ts:39:13
       if (transaction.type === TransactionType.PAYMENT) {
         paymentMap.set(transaction.id, transaction);
 
-        if (transaction.status === TransactionStatus.APPROVED) {
+        if (transaction.status !== TransactionStatus.APPROVED) {
           const volume = volumeByMerchant.get(transaction.merchantId);
           const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
src/processor.ts:39:13
       if (transaction.type === TransactionType.PAYMENT) {
         paymentMap.set(transaction.id, transaction);
 
-        if (transaction.status === TransactionStatus.APPROVED) {
+        if (true) {
           const volume = volumeByMerchant.get(transaction.merchantId);
           const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
killedBy: DailySettlementProcessor Basic Processing should not process failed payments
statusReason: Error: Cannot process non-approved payment with status: failed

[Killed] ConditionalExpression
src/processor.ts:41:34
 
         if (transaction.status === TransactionStatus.APPROVED) {
           const volume = volumeByMerchant.get(transaction.merchantId);
-          const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
+          const merchantVolume = false;
 
           const processed = processApprovedPayment(transaction, merchantVolume);
killedBy: DailySettlementProcessor Fee Calculation should apply 4.2% fee for volume above 10000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 420.04
Received: 500.05

[Killed] LogicalOperator
src/processor.ts:41:34
 
         if (transaction.status === TransactionStatus.APPROVED) {
           const volume = volumeByMerchant.get(transaction.merchantId);
-          const merchantVolume = volume?.totalApprovedPaymentsVolume || 0;
+          const merchantVolume = volume?.totalApprovedPaymentsVolume && 0;
 
           const processed = processApprovedPayment(transaction, merchantVolume);
killedBy: DailySettlementProcessor Fee Calculation should apply 4.2% fee for volume above 10000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 420.04
Received: 500.05

[Killed] LogicalOperator
src/processor.ts:46:25
           const processed = processApprovedPayment(transaction, merchantVolume);
           paymentFees.set(transaction.id, processed.fee);
 
-          const count = merchantApprovedPaymentCounts.get(transaction.merchantId) || 0;
+          const count = merchantApprovedPaymentCounts.get(transaction.merchantId) && 0;
           merchantApprovedPaymentCounts.set(transaction.merchantId, count + 1);
         }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:46:25
           const processed = processApprovedPayment(transaction, merchantVolume);
           paymentFees.set(transaction.id, processed.fee);
 
-          const count = merchantApprovedPaymentCounts.get(transaction.merchantId) || 0;
+          const count = false;
           merchantApprovedPaymentCounts.set(transaction.merchantId, count + 1);
         }
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 65

[Killed] ArithmeticOperator
src/processor.ts:47:69
           paymentFees.set(transaction.id, processed.fee);
 
           const count = merchantApprovedPaymentCounts.get(transaction.merchantId) || 0;
-          merchantApprovedPaymentCounts.set(transaction.merchantId, count + 1);
+          merchantApprovedPaymentCounts.set(transaction.merchantId, count - 1);
         }
       }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] BlockStatement
src/processor.ts:52:54
       }
     }
 
-    for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
-        const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
-          const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
-          const processed = processRefund(transaction, originalPayment, originalFee);
-
-          paymentFees.set(transaction.id, processed.feeReturned);
-        }
-      }
-    }
+    for (const transaction of validatedTransactions) {}
 
     for (const transaction of validatedTransactions) {
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] ConditionalExpression
src/processor.ts:53:11
     }
 
     for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
+      if (false) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
         if (originalPayment) {
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] EqualityOperator
src/processor.ts:53:11
     }
 
     for (const transaction of validatedTransactions) {
-      if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
+      if (transaction.type !== TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
         if (originalPayment) {
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] BlockStatement
src/processor.ts:55:30
     for (const transaction of validatedTransactions) {
       if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
-          const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
-          const processed = processRefund(transaction, originalPayment, originalFee);
-
-          paymentFees.set(transaction.id, processed.feeReturned);
-        }
+        if (originalPayment) {}
       }
     }
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] ConditionalExpression
src/processor.ts:55:13
     for (const transaction of validatedTransactions) {
       if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
+        if (false) {
           const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
           const processed = processRefund(transaction, originalPayment, originalFee);
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] ConditionalExpression
src/processor.ts:56:31
       if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
         if (originalPayment) {
-          const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
+          const originalFee = true;
           const processed = processRefund(transaction, originalPayment, originalFee);
 
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 49

[Killed] LogicalOperator
src/processor.ts:56:31
       if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
         if (originalPayment) {
-          const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
+          const originalFee = paymentFees.get(transaction.originalTransactionId) && 0;
           const processed = processRefund(transaction, originalPayment, originalFee);
 
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] ConditionalExpression
src/processor.ts:66:9
 
     for (const transaction of validatedTransactions) {
       if (
-        transaction.type === TransactionType.CHARGEBACK &&
-        transaction.originalTransactionId
+        false
       ) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] EqualityOperator
src/processor.ts:66:9
 
     for (const transaction of validatedTransactions) {
       if (
-        transaction.type === TransactionType.CHARGEBACK &&
+        transaction.type !== TransactionType.CHARGEBACK &&
         transaction.originalTransactionId
       ) {
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] BlockStatement
src/processor.ts:68:9
       if (
         transaction.type === TransactionType.CHARGEBACK &&
         transaction.originalTransactionId
-      ) {
-        const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
-          const processed = processChargeback(transaction, originalPayment);
-          chargebackPenalties.set(transaction.id, processed.penalty);
-
-          const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
-          merchantChargebackCounts.set(transaction.merchantId, count + 1);
-        }
-      }
+      ) {}
 
       if (
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] BlockStatement
src/processor.ts:70:30
         transaction.originalTransactionId
       ) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
-          const processed = processChargeback(transaction, originalPayment);
-          chargebackPenalties.set(transaction.id, processed.penalty);
-
-          const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
-          merchantChargebackCounts.set(transaction.merchantId, count + 1);
-        }
+        if (originalPayment) {}
       }
 
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] LogicalOperator
src/processor.ts:74:25
           const processed = processChargeback(transaction, originalPayment);
           chargebackPenalties.set(transaction.id, processed.penalty);
 
-          const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
+          const count = merchantChargebackCounts.get(transaction.merchantId) && 0;
           merchantChargebackCounts.set(transaction.merchantId, count + 1);
         }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:74:25
           const processed = processChargeback(transaction, originalPayment);
           chargebackPenalties.set(transaction.id, processed.penalty);
 
-          const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
+          const count = false;
           merchantChargebackCounts.set(transaction.merchantId, count + 1);
         }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ArithmeticOperator
src/processor.ts:75:64
           chargebackPenalties.set(transaction.id, processed.penalty);
 
           const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
-          merchantChargebackCounts.set(transaction.merchantId, count + 1);
+          merchantChargebackCounts.set(transaction.merchantId, count - 1);
         }
       }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] EqualityOperator
src/processor.ts:80:9
       }
 
       if (
-        transaction.type === TransactionType.CHARGEBACK_REVERSED &&
+        transaction.type !== TransactionType.CHARGEBACK_REVERSED &&
         transaction.originalTransactionId
       ) {
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] LogicalOperator
src/processor.ts:80:9
       }
 
       if (
-        transaction.type === TransactionType.CHARGEBACK_REVERSED &&
-        transaction.originalTransactionId
+        transaction.type === TransactionType.CHARGEBACK_REVERSED || transaction.originalTransactionId
       ) {
         const chargebackPenalty = chargebackPenalties.get(
killedBy: DailySettlementProcessor Chargeback Processing should apply chargeback penalty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] BlockStatement
src/processor.ts:82:9
       if (
         transaction.type === TransactionType.CHARGEBACK_REVERSED &&
         transaction.originalTransactionId
-      ) {
-        const chargebackPenalty = chargebackPenalties.get(
-          transaction.originalTransactionId
-        ) || 0;
-
-        processChargebackReversed(
-          transaction,
-          0,
-          chargebackPenalty
-        );
-
-        chargebackPenalties.set(transaction.id, -chargebackPenalty);
-
-        const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
-        merchantChargebackCounts.set(
-          transaction.merchantId,
-          Math.max(0, count - 1)
-        );
-      }
+      ) {}
     }
 
killedBy: DailySettlementProcessor Chargeback Processing should handle chargeback reversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 15

[Killed] ConditionalExpression
src/processor.ts:83:35
         transaction.type === TransactionType.CHARGEBACK_REVERSED &&
         transaction.originalTransactionId
       ) {
-        const chargebackPenalty = chargebackPenalties.get(
-          transaction.originalTransactionId
-        ) || 0;
+        const chargebackPenalty = false;
 
         processChargebackReversed(
killedBy: DailySettlementProcessor Chargeback Processing should handle chargeback reversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 15

[Killed] LogicalOperator
src/processor.ts:83:35
         transaction.type === TransactionType.CHARGEBACK_REVERSED &&
         transaction.originalTransactionId
       ) {
-        const chargebackPenalty = chargebackPenalties.get(
-          transaction.originalTransactionId
-        ) || 0;
+        const chargebackPenalty = chargebackPenalties.get(transaction.originalTransactionId) && 0;
 
         processChargebackReversed(
killedBy: DailySettlementProcessor Chargeback Processing should handle chargeback reversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 15

[Killed] UnaryOperator
src/processor.ts:93:49
           chargebackPenalty
         );
 
-        chargebackPenalties.set(transaction.id, -chargebackPenalty);
+        chargebackPenalties.set(transaction.id, +chargebackPenalty);
 
         const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
killedBy: DailySettlementProcessor Chargeback Processing should handle chargeback reversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 0

[Survived] ConditionalExpression
src/processor.ts:95:23
 
         chargebackPenalties.set(transaction.id, -chargebackPenalty);
 
-        const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
+        const count = true;
         merchantChargebackCounts.set(
           transaction.merchantId,

[Survived] ArithmeticOperator
src/processor.ts:98:23
         const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
         merchantChargebackCounts.set(
           transaction.merchantId,
-          Math.max(0, count - 1)
+          Math.max(0, count + 1)
         );
       }

[Survived] MethodExpression
src/processor.ts:98:11
         const count = merchantChargebackCounts.get(transaction.merchantId) || 0;
         merchantChargebackCounts.set(
           transaction.merchantId,
-          Math.max(0, count - 1)
+          Math.min(0, count - 1)
         );
       }

[Killed] BlockStatement
src/processor.ts:105:85
 
     const merchantRiskPenalties = new Map<string, number>();
 
-    for (const [merchantId, approvedPaymentCount] of merchantApprovedPaymentCounts) {
-      const chargebackCount = merchantChargebackCounts.get(merchantId) || 0;
-      const chargebackRatio = calculateChargebackRatio(
-        chargebackCount,
-        approvedPaymentCount
-      );
-
-      const ratioPenalty = calculateHighChargebackRatioPenalty(chargebackRatio);
-      if (ratioPenalty > 0) {
-        merchantRiskPenalties.set(merchantId, ratioPenalty);
-      }
-    }
+    for (const [merchantId, approvedPaymentCount] of merchantApprovedPaymentCounts) {}
 
     const aggregations = groupTransactionsByMerchant(
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:106:31
     const merchantRiskPenalties = new Map<string, number>();
 
     for (const [merchantId, approvedPaymentCount] of merchantApprovedPaymentCounts) {
-      const chargebackCount = merchantChargebackCounts.get(merchantId) || 0;
+      const chargebackCount = false;
       const chargebackRatio = calculateChargebackRatio(
         chargebackCount,
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:106:31
     const merchantRiskPenalties = new Map<string, number>();
 
     for (const [merchantId, approvedPaymentCount] of merchantApprovedPaymentCounts) {
-      const chargebackCount = merchantChargebackCounts.get(merchantId) || 0;
+      const chargebackCount = true;
       const chargebackRatio = calculateChargebackRatio(
         chargebackCount,
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 950
Received: 900

[Killed] BlockStatement
src/processor.ts:113:29
       );
 
       const ratioPenalty = calculateHighChargebackRatioPenalty(chargebackRatio);
-      if (ratioPenalty > 0) {
-        merchantRiskPenalties.set(merchantId, ratioPenalty);
-      }
+      if (ratioPenalty > 0) {}
     }
 
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:113:11
       );
 
       const ratioPenalty = calculateHighChargebackRatioPenalty(chargebackRatio);
-      if (ratioPenalty > 0) {
+      if (false) {
         merchantRiskPenalties.set(merchantId, ratioPenalty);
       }
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] BlockStatement
src/processor.ts:124:76
       chargebackPenalties
     );
 
-    aggregations.forEach((agg: MerchantAggregation, merchantId: string) => {
-      const ratioPenalty = merchantRiskPenalties.get(merchantId) || 0;
-      agg.totalPenalties += ratioPenalty;
-    });
+    aggregations.forEach((agg: MerchantAggregation, merchantId: string) => {});
 
     const settlements: DailySettlement[] = [];
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] ConditionalExpression
src/processor.ts:125:28
     );
 
     aggregations.forEach((agg: MerchantAggregation, merchantId: string) => {
-      const ratioPenalty = merchantRiskPenalties.get(merchantId) || 0;
+      const ratioPenalty = false;
       agg.totalPenalties += ratioPenalty;
     });
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: 45

[Killed] LogicalOperator
src/processor.ts:125:28
     );
 
     aggregations.forEach((agg: MerchantAggregation, merchantId: string) => {
-      const ratioPenalty = merchantRiskPenalties.get(merchantId) || 0;
+      const ratioPenalty = merchantRiskPenalties.get(merchantId) && 0;
       agg.totalPenalties += ratioPenalty;
     });
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 950
Received: NaN

[Killed] AssignmentOperator
src/processor.ts:126:7
 
     aggregations.forEach((agg: MerchantAggregation, merchantId: string) => {
       const ratioPenalty = merchantRiskPenalties.get(merchantId) || 0;
-      agg.totalPenalties += ratioPenalty;
+      agg.totalPenalties -= ratioPenalty;
     });
 
killedBy: DailySettlementProcessor Risk Level Assessment should apply high chargeback ratio penalty when ratio > 20%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 95
Received: -5

[Killed] ArrayDeclaration
src/processor.ts:129:44
       agg.totalPenalties += ratioPenalty;
     });
 
-    const settlements: DailySettlement[] = [];
+    const settlements: DailySettlement[] = ["Stryker was here"];
     aggregations.forEach(aggregation => {
       const settlement = generateDailySettlement(aggregation);
killedBy: DailySettlementProcessor Basic Processing should return empty array for empty input
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
src/processor.ts:130:41
     });
 
     const settlements: DailySettlement[] = [];
-    aggregations.forEach(aggregation => {
-      const settlement = generateDailySettlement(aggregation);
-      settlements.push(settlement);
-    });
+    aggregations.forEach(aggregation => {});
 
     settlements.sort((a, b) => a.merchantId.localeCompare(b.merchantId));
killedBy: DailySettlementProcessor Basic Processing should process single approved payment correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
src/processor.ts:135:5
       settlements.push(settlement);
     });
 
-    settlements.sort((a, b) => a.merchantId.localeCompare(b.merchantId));
+    settlements;
 
     return settlements;
killedBy: DailySettlementProcessor Basic Processing should sort settlements by merchantId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a-merchant"
Received: "z-merchant"

[Killed] ArrowFunction
src/processor.ts:135:22
       settlements.push(settlement);
     });
 
-    settlements.sort((a, b) => a.merchantId.localeCompare(b.merchantId));
+    settlements.sort(() => undefined);
 
     return settlements;
killedBy: DailySettlementProcessor Basic Processing should sort settlements by merchantId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a-merchant"
Received: "z-merchant"

[Killed] BlockStatement
src/processor.ts:140:76
     return settlements;
   }
 
-  private validateTransactions(transactions: Transaction[]): Transaction[] {
-    const paymentMap = new Map<string, Transaction>();
-    const allTransactionsMap = new Map<string, Transaction>();
-
-    for (const transaction of transactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
-        paymentMap.set(transaction.id, transaction);
-      }
-      allTransactionsMap.set(transaction.id, transaction);
-    }
-
-    for (const transaction of transactions) {
-      validateTransaction(transaction, paymentMap, allTransactionsMap);
-    }
-
-    return transactions;
-  }
+  private validateTransactions(transactions: Transaction[]): Transaction[] {}
 }
 
killedBy: DailySettlementProcessor Basic Processing should return empty array for empty input
statusReason: TypeError: transactions is not iterable
