[Killed] BlockStatement
src/processor.ts:144:45
     const paymentMap = new Map<string, Transaction>();
     const allTransactionsMap = new Map<string, Transaction>();
 
-    for (const transaction of transactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
-        paymentMap.set(transaction.id, transaction);
-      }
-      allTransactionsMap.set(transaction.id, transaction);
-    }
+    for (const transaction of transactions) {}
 
     for (const transaction of transactions) {
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: ValidationError: Refund references non-existent payment: pay-1

[Killed] ConditionalExpression
src/processor.ts:145:11
     const allTransactionsMap = new Map<string, Transaction>();
 
     for (const transaction of transactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
+      if (false) {
         paymentMap.set(transaction.id, transaction);
       }
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: ValidationError: Refund references non-existent payment: pay-1

[Killed] EqualityOperator
src/processor.ts:145:11
     const allTransactionsMap = new Map<string, Transaction>();
 
     for (const transaction of transactions) {
-      if (transaction.type === TransactionType.PAYMENT) {
+      if (transaction.type !== TransactionType.PAYMENT) {
         paymentMap.set(transaction.id, transaction);
       }
killedBy: DailySettlementProcessor Refund Processing should return full fee for refund within 7 days
statusReason: ValidationError: Refund references non-existent payment: pay-1

[Killed] BlockStatement
src/processor.ts:151:45
       allTransactionsMap.set(transaction.id, transaction);
     }
 
-    for (const transaction of transactions) {
-      validateTransaction(transaction, paymentMap, allTransactionsMap);
-    }
+    for (const transaction of transactions) {}
 
     return transactions;
killedBy: DailySettlementProcessor Refund Processing should throw error for refund without originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must have an originalTransactionId"

Received function did not throw
