[Killed] BlockStatement
src/services/chargebackProcessor.ts:24:24
 export function processChargeback(
   chargebackTransaction: Transaction,
   originalPayment: Transaction
-): ProcessedChargeback {
-  const chargebackAmount = roundToTwoDecimals(originalPayment.amount);
-
-  const penalty = roundToTwoDecimals(CHARGEBACK_FIXED_PENALTY);
-
-  const totalDeduction = roundToTwoDecimals(chargebackAmount + penalty);
-
-  return {
-    chargebackTransactionId: chargebackTransaction.id,
-    originalPaymentId: originalPayment.id,
-    chargebackAmount,
-    penalty,
-    totalDeduction
-  };
-}
+): ProcessedChargeback {}
 
 export function processChargebackReversed(
killedBy: Chargeback Processor processChargeback should return ProcessedChargeback object
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArithmeticOperator
src/services/chargebackProcessor.ts:29:45
 
   const penalty = roundToTwoDecimals(CHARGEBACK_FIXED_PENALTY);
 
-  const totalDeduction = roundToTwoDecimals(chargebackAmount + penalty);
+  const totalDeduction = roundToTwoDecimals(chargebackAmount - penalty);
 
   return {
killedBy: Chargeback Processor processChargeback should return totalDeduction greater than chargebackAmount
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 100
Received:   85

[Killed] ObjectLiteral
src/services/chargebackProcessor.ts:31:10
 
   const totalDeduction = roundToTwoDecimals(chargebackAmount + penalty);
 
-  return {
-    chargebackTransactionId: chargebackTransaction.id,
-    originalPaymentId: originalPayment.id,
-    chargebackAmount,
-    penalty,
-    totalDeduction
-  };
+  return {};
 }
 
killedBy: Chargeback Processor processChargeback should return ProcessedChargeback object
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "chargebackTransactionId"
Received path: []

Received value: {}

[Killed] BlockStatement
src/services/chargebackProcessor.ts:44:32
   chargebackReversedTransaction: Transaction,
   originalChargebackAmount: number,
   originalChargebackPenalty: number
-): ProcessedChargebackReversed {
-  const chargebackAmountReversed = roundToTwoDecimals(originalChargebackAmount);
-  const penaltyRemoved = roundToTwoDecimals(originalChargebackPenalty);
-  const totalReversed = roundToTwoDecimals(chargebackAmountReversed + penaltyRemoved);
-
-  return {
-    chargebackReversedTransactionId: chargebackReversedTransaction.id,
-    originalChargebackId: chargebackReversedTransaction.originalTransactionId || '',
-    chargebackAmountReversed,
-    penaltyRemoved,
-    totalReversed
-  };
-}
+): ProcessedChargebackReversed {}
 
killedBy: Chargeback Processor processChargebackReversed should return ProcessedChargebackReversed object
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ArithmeticOperator
src/services/chargebackProcessor.ts:47:44
 ): ProcessedChargebackReversed {
   const chargebackAmountReversed = roundToTwoDecimals(originalChargebackAmount);
   const penaltyRemoved = roundToTwoDecimals(originalChargebackPenalty);
-  const totalReversed = roundToTwoDecimals(chargebackAmountReversed + penaltyRemoved);
+  const totalReversed = roundToTwoDecimals(chargebackAmountReversed - penaltyRemoved);
 
   return {
killedBy: Chargeback Processor processChargebackReversed should return totalReversed greater than chargebackAmountReversed
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 100
Received:   85

[Killed] ConditionalExpression
src/services/chargebackProcessor.ts:51:27
 
   return {
     chargebackReversedTransactionId: chargebackReversedTransaction.id,
-    originalChargebackId: chargebackReversedTransaction.originalTransactionId || '',
+    originalChargebackId: true,
     chargebackAmountReversed,
     penaltyRemoved,
killedBy: Chargeback Processor processChargebackReversed should handle missing originalTransactionId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: true

[Killed] ConditionalExpression
src/services/chargebackProcessor.ts:51:27
 
   return {
     chargebackReversedTransactionId: chargebackReversedTransaction.id,
-    originalChargebackId: chargebackReversedTransaction.originalTransactionId || '',
+    originalChargebackId: false,
     chargebackAmountReversed,
     penaltyRemoved,
killedBy: Chargeback Processor processChargebackReversed should handle missing originalTransactionId
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: false
