[Killed] BlockStatement
src/services/paymentProcessor.ts:16:63
   netAmount: number;
 }
 
-export function calculateFeeRate(totalVolume: number): number {
-  if (totalVolume > HIGH_VOLUME_THRESHOLD) {
-    return HIGH_VOLUME_PAYMENT_FEE_RATE;
-  }
-  return DEFAULT_PAYMENT_FEE_RATE;
-}
+export function calculateFeeRate(totalVolume: number): number {}
 
 export function calculatePaymentFee(amount: number, feeRate: number): number {
killedBy: Payment Processor processApprovedPayment should apply fee for low volume
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   NaN

[Killed] EqualityOperator
src/services/paymentProcessor.ts:17:7
 }
 
 export function calculateFeeRate(totalVolume: number): number {
-  if (totalVolume > HIGH_VOLUME_THRESHOLD) {
+  if (totalVolume >= HIGH_VOLUME_THRESHOLD) {
     return HIGH_VOLUME_PAYMENT_FEE_RATE;
   }
killedBy: Payment Processor processApprovedPayment should apply 5% fee when volume is exactly 10000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4.2

[Killed] ConditionalExpression
src/services/paymentProcessor.ts:17:7
 }
 
 export function calculateFeeRate(totalVolume: number): number {
-  if (totalVolume > HIGH_VOLUME_THRESHOLD) {
+  if (true) {
     return HIGH_VOLUME_PAYMENT_FEE_RATE;
   }
killedBy: Payment Processor processApprovedPayment should apply 5% fee when volume is exactly 10000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4.2

[Killed] BlockStatement
src/services/paymentProcessor.ts:23:78
   return DEFAULT_PAYMENT_FEE_RATE;
 }
 
-export function calculatePaymentFee(amount: number, feeRate: number): number {
-  const fee = amount * feeRate;
-  return roundToTwoDecimals(fee);
-}
+export function calculatePaymentFee(amount: number, feeRate: number): number {}
 
 export function calculatePaymentNetAmount(amount: number, fee: number): number {
killedBy: Payment Processor processApprovedPayment should return object with correct structure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] ArithmeticOperator
src/services/paymentProcessor.ts:24:15
 }
 
 export function calculatePaymentFee(amount: number, feeRate: number): number {
-  const fee = amount * feeRate;
+  const fee = amount / feeRate;
   return roundToTwoDecimals(fee);
 }
killedBy: Payment Processor processApprovedPayment should work with large amounts
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   -18999981

[Killed] BlockStatement
src/services/paymentProcessor.ts:28:80
   return roundToTwoDecimals(fee);
 }
 
-export function calculatePaymentNetAmount(amount: number, fee: number): number {
-  const netAmount = amount - fee;
-  return roundToTwoDecimals(netAmount);
-}
+export function calculatePaymentNetAmount(amount: number, fee: number): number {}
 
 export function processApprovedPayment(
killedBy: Payment Processor processApprovedPayment should return object with correct structure
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] ArithmeticOperator
src/services/paymentProcessor.ts:29:21
 }
 
 export function calculatePaymentNetAmount(amount: number, fee: number): number {
-  const netAmount = amount - fee;
+  const netAmount = amount + fee;
   return roundToTwoDecimals(netAmount);
 }
killedBy: Payment Processor processApprovedPayment should have netAmount less than amount
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1000
Received:   1050

[Killed] BlockStatement
src/services/paymentProcessor.ts:36:21
 export function processApprovedPayment(
   transaction: Transaction,
   totalApprovedPaymentsVolume: number
-): ProcessedPayment {
-  if (transaction.status !== TransactionStatus.APPROVED) {
-    throw new Error(`Cannot process non-approved payment with status: ${transaction.status}`);
-  }
-
-  const feeRate = calculateFeeRate(totalApprovedPaymentsVolume);
-
-  const fee = calculatePaymentFee(transaction.amount, feeRate);
-
-  const netAmount = calculatePaymentNetAmount(transaction.amount, fee);
-
-  return {
-    transactionId: transaction.id,
-    amount: transaction.amount,
-    fee,
-    netAmount
-  };
-}
+): ProcessedPayment {}
 
killedBy: Payment Processor processApprovedPayment should return a ProcessedPayment object
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] ConditionalExpression
src/services/paymentProcessor.ts:37:7
   transaction: Transaction,
   totalApprovedPaymentsVolume: number
 ): ProcessedPayment {
-  if (transaction.status !== TransactionStatus.APPROVED) {
+  if (false) {
     throw new Error(`Cannot process non-approved payment with status: ${transaction.status}`);
   }
killedBy: Payment Processor processApprovedPayment should throw error for pending payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Cannot process non-approved payment with status: pending"

Received function did not throw

[Killed] EqualityOperator
src/services/paymentProcessor.ts:37:7
   transaction: Transaction,
   totalApprovedPaymentsVolume: number
 ): ProcessedPayment {
-  if (transaction.status !== TransactionStatus.APPROVED) {
+  if (transaction.status === TransactionStatus.APPROVED) {
     throw new Error(`Cannot process non-approved payment with status: ${transaction.status}`);
   }
killedBy: Payment Processor processApprovedPayment should not throw error for approved payment
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Cannot process non-approved payment with status: approved"

       99 |       } else {
      100 |         stryCov_9fa48("206");
    > 101 |         throw new Error(stryMutAct_9fa48("207") ? `` : (stryCov_9fa48("207"), `Cannot process non-approved payment with status: ${transaction.status}`));

[Killed] ObjectLiteral
src/services/paymentProcessor.ts:47:10
 
   const netAmount = calculatePaymentNetAmount(transaction.amount, fee);
 
-  return {
-    transactionId: transaction.id,
-    amount: transaction.amount,
-    fee,
-    netAmount
-  };
+  return {};
 }
 
killedBy: Payment Processor processApprovedPayment should return a ProcessedPayment object
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "transactionId"
Received path: []

Received value: {}
