[Killed] BlockStatement
src/services/refundProcessor.ts:17:11
 export function calculateDaysDifference(
   refundDate: Date,
   paymentDate: Date
-): number {
-  const timeDifference = refundDate.getTime() - paymentDate.getTime();
-  const daysDifference = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
-  return daysDifference;
-}
+): number {}
 
 export function isWithinFullRefundWindow(
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/services/refundProcessor.ts:18:26
   refundDate: Date,
   paymentDate: Date
 ): number {
-  const timeDifference = refundDate.getTime() - paymentDate.getTime();
+  const timeDifference = refundDate.getTime() + paymentDate.getTime();
   const daysDifference = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
   return daysDifference;
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/services/refundProcessor.ts:19:37
   paymentDate: Date
 ): number {
   const timeDifference = refundDate.getTime() - paymentDate.getTime();
-  const daysDifference = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
+  const daysDifference = Math.floor(timeDifference * (1000 * 60 * 60 * 24));
   return daysDifference;
 }
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/services/refundProcessor.ts:19:55
   paymentDate: Date
 ): number {
   const timeDifference = refundDate.getTime() - paymentDate.getTime();
-  const daysDifference = Math.floor(timeDifference / (1000 * 60 * 60 * 24));
+  const daysDifference = Math.floor(timeDifference / (1000 * 60 / 60 * 24));
   return daysDifference;
 }
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/services/refundProcessor.ts:26:12
 export function isWithinFullRefundWindow(
   refundDate: Date,
   paymentDate: Date
-): boolean {
-  const daysDifference = calculateDaysDifference(refundDate, paymentDate);
-  return daysDifference <= REFUND_FULL_WINDOW_DAYS;
-}
+): boolean {}
 
 export function processRefund(
killedBy: Refund Processor processRefund should have isFullRefund property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: "undefined"

[Killed] ConditionalExpression
src/services/refundProcessor.ts:28:10
   paymentDate: Date
 ): boolean {
   const daysDifference = calculateDaysDifference(refundDate, paymentDate);
-  return daysDifference <= REFUND_FULL_WINDOW_DAYS;
+  return true;
 }
 
killedBy: Refund Processor processRefund should not return fee at 8 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
src/services/refundProcessor.ts:28:10
   paymentDate: Date
 ): boolean {
   const daysDifference = calculateDaysDifference(refundDate, paymentDate);
-  return daysDifference <= REFUND_FULL_WINDOW_DAYS;
+  return false;
 }
 
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/services/refundProcessor.ts:36:58
   originalPayment: Transaction,
   originalPaymentFee: number
 ): ProcessedRefund {
-  if (refundTransaction.amount > originalPayment.amount) {
-    throw new Error(
-      `Refund amount (${refundTransaction.amount}) cannot exceed original payment amount (${originalPayment.amount})`
-    );
-  }
+  if (refundTransaction.amount > originalPayment.amount) {}
 
   const isFullWindow = isWithinFullRefundWindow(
killedBy: Refund Processor processRefund should throw error when refund exceeds original payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund amount (101) cannot exceed original payment amount (100)"

Received function did not throw

[Killed] EqualityOperator
src/services/refundProcessor.ts:36:7
   originalPayment: Transaction,
   originalPaymentFee: number
 ): ProcessedRefund {
-  if (refundTransaction.amount > originalPayment.amount) {
+  if (refundTransaction.amount <= originalPayment.amount) {
     throw new Error(
       `Refund amount (${refundTransaction.amount}) cannot exceed original payment amount (${originalPayment.amount})`
killedBy: Refund Processor processRefund should not throw error for valid refund within window
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Refund amount (50) cannot exceed original payment amount (100)"

      86 |       } else {
      87 |         stryCov_9fa48("225");
    > 88 |         throw new Error(stryMutAct_9fa48("226") ? `` : (stryCov_9fa48("226"), `Refund amount (${refundTransaction.amount}) cannot exceed original payment amount (${originalPayment

[Killed] ConditionalExpression
src/services/refundProcessor.ts:49:7
 
   let feeReturned = 0;
 
-  if (isFullWindow) {
+  if (false) {
     feeReturned = roundToTwoDecimals(originalPaymentFee);
   }
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/services/refundProcessor.ts:49:7
 
   let feeReturned = 0;
 
-  if (isFullWindow) {
+  if (true) {
     feeReturned = roundToTwoDecimals(originalPaymentFee);
   }
killedBy: Refund Processor processRefund should not return fee at 8 days
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ArithmeticOperator
src/services/refundProcessor.ts:53:48
     feeReturned = roundToTwoDecimals(originalPaymentFee);
   }
 
-  const totalRefundAmount = roundToTwoDecimals(refundTransaction.amount + feeReturned);
+  const totalRefundAmount = roundToTwoDecimals(refundTransaction.amount - feeReturned);
 
   return {
killedBy: Refund Processor processRefund should return fee within 7 days exactly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 105
Received: 95
