[Killed] BlockStatement
src/services/riskManager.ts:17:81
   riskLevel: RiskLevel;
 }
 
-export function incrementChargebackCount(merchantState: MerchantState): boolean {
-  merchantState.chargebackCount += 1;
-  return merchantState.chargebackCount >= CHARGEBACK_RISK_THRESHOLD;
-}
+export function incrementChargebackCount(merchantState: MerchantState): boolean {}
 
 export function decrementChargebackCount(merchantState: MerchantState): void {
killedBy: Risk Manager incrementChargebackCount should return a boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: "undefined"

[Killed] AssignmentOperator
src/services/riskManager.ts:18:3
 }
 
 export function incrementChargebackCount(merchantState: MerchantState): boolean {
-  merchantState.chargebackCount += 1;
+  merchantState.chargebackCount -= 1;
   return merchantState.chargebackCount >= CHARGEBACK_RISK_THRESHOLD;
 }
killedBy: Risk Manager incrementChargebackCount should increase chargebackCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] EqualityOperator
src/services/riskManager.ts:19:10
 
 export function incrementChargebackCount(merchantState: MerchantState): boolean {
   merchantState.chargebackCount += 1;
-  return merchantState.chargebackCount >= CHARGEBACK_RISK_THRESHOLD;
+  return merchantState.chargebackCount < CHARGEBACK_RISK_THRESHOLD;
 }
 
killedBy: Risk Manager incrementChargebackCount should return false for low count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/services/riskManager.ts:19:10
 
 export function incrementChargebackCount(merchantState: MerchantState): boolean {
   merchantState.chargebackCount += 1;
-  return merchantState.chargebackCount >= CHARGEBACK_RISK_THRESHOLD;
+  return false;
 }
 
killedBy: Risk Manager incrementChargebackCount should return true when count reaches 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/services/riskManager.ts:22:78
   return merchantState.chargebackCount >= CHARGEBACK_RISK_THRESHOLD;
 }
 
-export function decrementChargebackCount(merchantState: MerchantState): void {
-  merchantState.chargebackCount = Math.max(0, merchantState.chargebackCount - 1);
-}
+export function decrementChargebackCount(merchantState: MerchantState): void {}
 
 export function calculateChargebackRatio(
killedBy: Risk Manager decrementChargebackCount should decrease chargebackCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArithmeticOperator
src/services/riskManager.ts:23:47
 }
 
 export function decrementChargebackCount(merchantState: MerchantState): void {
-  merchantState.chargebackCount = Math.max(0, merchantState.chargebackCount - 1);
+  merchantState.chargebackCount = Math.max(0, merchantState.chargebackCount + 1);
 }
 
killedBy: Risk Manager decrementChargebackCount should decrease chargebackCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] MethodExpression
src/services/riskManager.ts:23:35
 }
 
 export function decrementChargebackCount(merchantState: MerchantState): void {
-  merchantState.chargebackCount = Math.max(0, merchantState.chargebackCount - 1);
+  merchantState.chargebackCount = Math.min(0, merchantState.chargebackCount - 1);
 }
 
killedBy: Risk Manager decrementChargebackCount should decrease chargebackCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/services/riskManager.ts:29:11
 export function calculateChargebackRatio(
   chargebackCount: number,
   totalApprovedPayments: number
-): number {
-  if (totalApprovedPayments === 0) {
-    return 0;
-  }
-  return chargebackCount / totalApprovedPayments;
-}
+): number {}
 
 export function determineRiskLevel(chargebackRatio: number): RiskLevel {
killedBy: Risk Manager calculateChargebackRatio should return a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] EqualityOperator
src/services/riskManager.ts:30:7
   chargebackCount: number,
   totalApprovedPayments: number
 ): number {
-  if (totalApprovedPayments === 0) {
+  if (totalApprovedPayments !== 0) {
     return 0;
   }
killedBy: Risk Manager calculateChargebackRatio should return 0 for zero approved payments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] BlockStatement
src/services/riskManager.ts:30:36
   chargebackCount: number,
   totalApprovedPayments: number
 ): number {
-  if (totalApprovedPayments === 0) {
-    return 0;
-  }
+  if (totalApprovedPayments === 0) {}
   return chargebackCount / totalApprovedPayments;
 }
killedBy: Risk Manager calculateChargebackRatio should return 0 for zero approved payments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] ArithmeticOperator
src/services/riskManager.ts:33:10
   if (totalApprovedPayments === 0) {
     return 0;
   }
-  return chargebackCount / totalApprovedPayments;
+  return chargebackCount * totalApprovedPayments;
 }
 
killedBy: Risk Manager calculateChargebackRatio should return ratio less than 1
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   10

[Killed] BlockStatement
src/services/riskManager.ts:36:72
   return chargebackCount / totalApprovedPayments;
 }
 
-export function determineRiskLevel(chargebackRatio: number): RiskLevel {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
-    return RiskLevel.HIGH;
-  }
-  if (chargebackRatio >= CHARGEBACK_RATIO_MEDIUM_THRESHOLD) {
-    return RiskLevel.MEDIUM;
-  }
-  return RiskLevel.LOW;
-}
+export function determineRiskLevel(chargebackRatio: number): RiskLevel {}
 
 export function updateMerchantRiskLevel(merchantState: MerchantState): void {
killedBy: Risk Manager determineRiskLevel should return a RiskLevel enum value
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: undefined
Received array: ["LOW", "MEDIUM", "HIGH"]

[Killed] ConditionalExpression
src/services/riskManager.ts:37:7
 }
 
 export function determineRiskLevel(chargebackRatio: number): RiskLevel {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
+  if (false) {
     return RiskLevel.HIGH;
   }
killedBy: Risk Manager determineRiskLevel should return HIGH for high ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "HIGH"
Received: "MEDIUM"

[Killed] ConditionalExpression
src/services/riskManager.ts:37:7
 }
 
 export function determineRiskLevel(chargebackRatio: number): RiskLevel {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
+  if (true) {
     return RiskLevel.HIGH;
   }
killedBy: Risk Manager determineRiskLevel should return LOW for low ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LOW"
Received: "HIGH"

[Killed] EqualityOperator
src/services/riskManager.ts:40:7
   if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
     return RiskLevel.HIGH;
   }
-  if (chargebackRatio >= CHARGEBACK_RATIO_MEDIUM_THRESHOLD) {
+  if (chargebackRatio < CHARGEBACK_RATIO_MEDIUM_THRESHOLD) {
     return RiskLevel.MEDIUM;
   }
killedBy: Risk Manager determineRiskLevel should return LOW for low ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LOW"
Received: "MEDIUM"

[Killed] BlockStatement
src/services/riskManager.ts:40:61
   if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
     return RiskLevel.HIGH;
   }
-  if (chargebackRatio >= CHARGEBACK_RATIO_MEDIUM_THRESHOLD) {
-    return RiskLevel.MEDIUM;
-  }
+  if (chargebackRatio >= CHARGEBACK_RATIO_MEDIUM_THRESHOLD) {}
   return RiskLevel.LOW;
 }
killedBy: Risk Manager determineRiskLevel should return MEDIUM for medium ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MEDIUM"
Received: "LOW"

[Killed] BlockStatement
src/services/riskManager.ts:46:77
   return RiskLevel.LOW;
 }
 
-export function updateMerchantRiskLevel(merchantState: MerchantState): void {
-  const chargebackRatio = calculateChargebackRatio(
-    merchantState.chargebackCount,
-    merchantState.totalApprovedPayments
-  );
-  merchantState.riskLevel = determineRiskLevel(chargebackRatio);
-}
+export function updateMerchantRiskLevel(merchantState: MerchantState): void {}
 
 export function calculateHighChargebackRatioPenalty(
killedBy: Risk Manager updateMerchantRiskLevel should set LOW for low ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LOW"
Received: "HIGH"

[Killed] BlockStatement
src/services/riskManager.ts:56:11
 
 export function calculateHighChargebackRatioPenalty(
   chargebackRatio: number
-): number {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
-    return roundToTwoDecimals(HIGH_CHARGEBACK_RATIO_PENALTY);
-  }
-  return 0;
-}
+): number {}
 
killedBy: Risk Manager calculateHighChargebackRatioPenalty should return a number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: "undefined"

[Killed] EqualityOperator
src/services/riskManager.ts:57:7
 export function calculateHighChargebackRatioPenalty(
   chargebackRatio: number
 ): number {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
+  if (chargebackRatio >= CHARGEBACK_RATIO_HIGH_THRESHOLD) {
     return roundToTwoDecimals(HIGH_CHARGEBACK_RATIO_PENALTY);
   }
killedBy: Risk Manager calculateHighChargebackRatioPenalty should return 0 for ratio exactly 0.2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50

[Killed] EqualityOperator
src/services/riskManager.ts:57:7
 export function calculateHighChargebackRatioPenalty(
   chargebackRatio: number
 ): number {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
+  if (chargebackRatio <= CHARGEBACK_RATIO_HIGH_THRESHOLD) {
     return roundToTwoDecimals(HIGH_CHARGEBACK_RATIO_PENALTY);
   }
killedBy: Risk Manager calculateHighChargebackRatioPenalty should return 0 for low ratio
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 50
