[Killed] BooleanLiteral
src/services/settlementProcessor.ts:26:9
   for (const transaction of transactions) {
     let aggregation = aggregationMap.get(transaction.merchantId);
 
-    if (!aggregation) {
+    if (aggregation) {
       aggregation = {
         merchantId: transaction.merchantId,
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: TypeError: Cannot read properties of undefined (reading 'grossAmount')

[Killed] BlockStatement
src/services/settlementProcessor.ts:26:23
   for (const transaction of transactions) {
     let aggregation = aggregationMap.get(transaction.merchantId);
 
-    if (!aggregation) {
-      aggregation = {
-        merchantId: transaction.merchantId,
-        grossAmount: 0,
-        totalFees: 0,
-        totalRefunds: 0,
-        totalChargebacks: 0,
-        totalPenalties: 0,
-        chargebackCount: 0,
-        approvedPaymentCount: 0
-      };
-      aggregationMap.set(transaction.merchantId, aggregation);
-    }
+    if (!aggregation) {}
 
     if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: TypeError: Cannot read properties of undefined (reading 'grossAmount')

[Killed] ObjectLiteral
src/services/settlementProcessor.ts:27:21
     let aggregation = aggregationMap.get(transaction.merchantId);
 
     if (!aggregation) {
-      aggregation = {
-        merchantId: transaction.merchantId,
-        grossAmount: 0,
-        totalFees: 0,
-        totalRefunds: 0,
-        totalChargebacks: 0,
-        totalPenalties: 0,
-        chargebackCount: 0,
-        approvedPaymentCount: 0
-      };
+      aggregation = {};
       aggregationMap.set(transaction.merchantId, aggregation);
     }
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "merchant-1"
Received: undefined

[Killed] BlockStatement
src/services/settlementProcessor.ts:40:108
       aggregationMap.set(transaction.merchantId, aggregation);
     }
 
-    if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {
-      aggregation.grossAmount += transaction.amount;
-      aggregation.approvedPaymentCount += 1;
-
-      const fee = paymentFees.get(transaction.id) || 0;
-      aggregation.totalFees += fee;
-    }
+    if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {}
 
     if (transaction.type === TransactionType.REFUND) {
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:40:9
       aggregationMap.set(transaction.merchantId, aggregation);
     }
 
-    if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {
+    if (false) {
       aggregation.grossAmount += transaction.amount;
       aggregation.approvedPaymentCount += 1;
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:41:7
     }
 
     if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {
-      aggregation.grossAmount += transaction.amount;
+      aggregation.grossAmount -= transaction.amount;
       aggregation.approvedPaymentCount += 1;
 
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -100

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:42:7
 
     if (transaction.type === TransactionType.PAYMENT && transaction.status === TransactionStatus.APPROVED) {
       aggregation.grossAmount += transaction.amount;
-      aggregation.approvedPaymentCount += 1;
+      aggregation.approvedPaymentCount -= 1;
 
       const fee = paymentFees.get(transaction.id) || 0;
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:44:19
       aggregation.grossAmount += transaction.amount;
       aggregation.approvedPaymentCount += 1;
 
-      const fee = paymentFees.get(transaction.id) || 0;
+      const fee = false;
       aggregation.totalFees += fee;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should add payment fees to total fees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:44:19
       aggregation.grossAmount += transaction.amount;
       aggregation.approvedPaymentCount += 1;
 
-      const fee = paymentFees.get(transaction.id) || 0;
+      const fee = true;
       aggregation.totalFees += fee;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:45:7
       aggregation.approvedPaymentCount += 1;
 
       const fee = paymentFees.get(transaction.id) || 0;
-      aggregation.totalFees += fee;
+      aggregation.totalFees -= fee;
     }
 
killedBy: Settlement Processor groupTransactionsByMerchant should add payment fees to total fees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] BlockStatement
src/services/settlementProcessor.ts:48:54
       aggregation.totalFees += fee;
     }
 
-    if (transaction.type === TransactionType.REFUND) {
-      aggregation.totalRefunds += transaction.amount;
-
-      const feeReturned = paymentFees.get(transaction.id) || 0;
-      aggregation.totalFees -= feeReturned;
-    }
+    if (transaction.type === TransactionType.REFUND) {}
 
     if (transaction.type === TransactionType.CHARGEBACK) {
killedBy: Settlement Processor groupTransactionsByMerchant should add refund amounts to total refunds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:48:9
       aggregation.totalFees += fee;
     }
 
-    if (transaction.type === TransactionType.REFUND) {
+    if (false) {
       aggregation.totalRefunds += transaction.amount;
 
killedBy: Settlement Processor groupTransactionsByMerchant should add refund amounts to total refunds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 0

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:49:7
     }
 
     if (transaction.type === TransactionType.REFUND) {
-      aggregation.totalRefunds += transaction.amount;
+      aggregation.totalRefunds -= transaction.amount;
 
       const feeReturned = paymentFees.get(transaction.id) || 0;
killedBy: Settlement Processor groupTransactionsByMerchant should add refund amounts to total refunds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: -50

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:51:27
     if (transaction.type === TransactionType.REFUND) {
       aggregation.totalRefunds += transaction.amount;
 
-      const feeReturned = paymentFees.get(transaction.id) || 0;
+      const feeReturned = true;
       aggregation.totalFees -= feeReturned;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should subtract refund fees from total fees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 4

[Killed] LogicalOperator
src/services/settlementProcessor.ts:51:27
     if (transaction.type === TransactionType.REFUND) {
       aggregation.totalRefunds += transaction.amount;
 
-      const feeReturned = paymentFees.get(transaction.id) || 0;
+      const feeReturned = paymentFees.get(transaction.id) && 0;
       aggregation.totalFees -= feeReturned;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should subtract refund fees from total fees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 5

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:52:7
       aggregation.totalRefunds += transaction.amount;
 
       const feeReturned = paymentFees.get(transaction.id) || 0;
-      aggregation.totalFees -= feeReturned;
+      aggregation.totalFees += feeReturned;
     }
 
killedBy: Settlement Processor groupTransactionsByMerchant should subtract refund fees from total fees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2.5
Received: 7.5

[Killed] BlockStatement
src/services/settlementProcessor.ts:55:58
       aggregation.totalFees -= feeReturned;
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK) {
-      aggregation.totalChargebacks += transaction.amount;
-      aggregation.chargebackCount += 1;
-
-      const penalty = chargebackPenalties.get(transaction.id) || 0;
-      aggregation.totalPenalties += penalty;
-    }
+    if (transaction.type === TransactionType.CHARGEBACK) {}
 
     if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback amounts to total chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:56:7
     }
 
     if (transaction.type === TransactionType.CHARGEBACK) {
-      aggregation.totalChargebacks += transaction.amount;
+      aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount += 1;
 
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback amounts to total chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -100

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:57:7
 
     if (transaction.type === TransactionType.CHARGEBACK) {
       aggregation.totalChargebacks += transaction.amount;
-      aggregation.chargebackCount += 1;
+      aggregation.chargebackCount -= 1;
 
       const penalty = chargebackPenalties.get(transaction.id) || 0;
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback amounts to total chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:59:23
       aggregation.totalChargebacks += transaction.amount;
       aggregation.chargebackCount += 1;
 
-      const penalty = chargebackPenalties.get(transaction.id) || 0;
+      const penalty = false;
       aggregation.totalPenalties += penalty;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback penalties to total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:59:23
       aggregation.totalChargebacks += transaction.amount;
       aggregation.chargebackCount += 1;
 
-      const penalty = chargebackPenalties.get(transaction.id) || 0;
+      const penalty = true;
       aggregation.totalPenalties += penalty;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback penalties to total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 1

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:60:7
       aggregation.chargebackCount += 1;
 
       const penalty = chargebackPenalties.get(transaction.id) || 0;
-      aggregation.totalPenalties += penalty;
+      aggregation.totalPenalties -= penalty;
     }
 
killedBy: Settlement Processor groupTransactionsByMerchant should add chargeback penalties to total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: -15

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:63:9
       aggregation.totalPenalties += penalty;
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+    if (true) {
       aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
killedBy: Settlement Processor groupTransactionsByMerchant should create aggregation for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -100

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:63:9
       aggregation.totalPenalties += penalty;
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+    if (false) {
       aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
killedBy: Settlement Processor groupTransactionsByMerchant should subtract chargeback reversed amounts from total chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 100

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:64:7
     }
 
     if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
-      aggregation.totalChargebacks -= transaction.amount;
+      aggregation.totalChargebacks += transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
 
killedBy: Settlement Processor groupTransactionsByMerchant should subtract chargeback reversed amounts from total chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 200

[Killed] MethodExpression
src/services/settlementProcessor.ts:65:37
 
     if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
       aggregation.totalChargebacks -= transaction.amount;
-      aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
+      aggregation.chargebackCount = Math.min(0, aggregation.chargebackCount - 1);
 
       const penaltyReversed = chargebackPenalties.get(transaction.id) || 0;
killedBy: Settlement Processor groupTransactionsByMerchant should not let chargeback count go negative with reversed chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -1

[Killed] ArithmeticOperator
src/services/settlementProcessor.ts:65:49
 
     if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
       aggregation.totalChargebacks -= transaction.amount;
-      aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
+      aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount + 1);
 
       const penaltyReversed = chargebackPenalties.get(transaction.id) || 0;
killedBy: Settlement Processor groupTransactionsByMerchant should decrement chargeback count for chargeback reversed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/services/settlementProcessor.ts:67:31
       aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
 
-      const penaltyReversed = chargebackPenalties.get(transaction.id) || 0;
+      const penaltyReversed = false;
       aggregation.totalPenalties -= penaltyReversed;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should subtract reversed chargeback penalties from total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 15

[Killed] LogicalOperator
src/services/settlementProcessor.ts:67:31
       aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
 
-      const penaltyReversed = chargebackPenalties.get(transaction.id) || 0;
+      const penaltyReversed = chargebackPenalties.get(transaction.id) && 0;
       aggregation.totalPenalties -= penaltyReversed;
     }
killedBy: Settlement Processor groupTransactionsByMerchant should subtract reversed chargeback penalties from total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 15

[Killed] AssignmentOperator
src/services/settlementProcessor.ts:68:7
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
 
       const penaltyReversed = chargebackPenalties.get(transaction.id) || 0;
-      aggregation.totalPenalties -= penaltyReversed;
+      aggregation.totalPenalties += penaltyReversed;
     }
   }
killedBy: Settlement Processor groupTransactionsByMerchant should subtract reversed chargeback penalties from total penalties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 30

[Killed] BlockStatement
src/services/settlementProcessor.ts:72:33
     }
   }
 
-  aggregationMap.forEach(agg => {
-    agg.grossAmount = roundToTwoDecimals(agg.grossAmount);
-    agg.totalFees = roundToTwoDecimals(agg.totalFees);
-    agg.totalRefunds = roundToTwoDecimals(agg.totalRefunds);
-    agg.totalChargebacks = roundToTwoDecimals(agg.totalChargebacks);
-    agg.totalPenalties = roundToTwoDecimals(agg.totalPenalties);
-  });
+  aggregationMap.forEach(agg => {});
 
   return aggregationMap;
killedBy: Settlement Processor groupTransactionsByMerchant should round all amounts to 2 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7.67
Received: 7.667

[Killed] BlockStatement
src/services/settlementProcessor.ts:83:78
   return aggregationMap;
 }
 
-export function calculateNetAmount(aggregation: MerchantAggregation): number {
-  const netAmount =
-    aggregation.grossAmount -
-    aggregation.totalFees -
-    aggregation.totalRefunds -
-    aggregation.totalChargebacks -
-    aggregation.totalPenalties;
-
-  return roundToTwoDecimals(netAmount);
-}
+export function calculateNetAmount(aggregation: MerchantAggregation): number {}
 
 export function generateDailySettlement(
killedBy: Settlement Processor calculateNetAmount should calculate exact net amount with no deductions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000
Received: undefined

[Killed] ArithmeticOperator
src/services/settlementProcessor.ts:85:5
 
 export function calculateNetAmount(aggregation: MerchantAggregation): number {
   const netAmount =
-    aggregation.grossAmount -
-    aggregation.totalFees -
-    aggregation.totalRefunds -
+    aggregation.grossAmount - aggregation.totalFees + aggregation.totalRefunds -
     aggregation.totalChargebacks -
     aggregation.totalPenalties;
killedBy: Settlement Processor calculateNetAmount should calculate exact net amount subtracting all deductions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600
Received: 700

[Killed] ArithmeticOperator
src/services/settlementProcessor.ts:85:5
 
 export function calculateNetAmount(aggregation: MerchantAggregation): number {
   const netAmount =
-    aggregation.grossAmount -
-    aggregation.totalFees -
+    aggregation.grossAmount + aggregation.totalFees -
     aggregation.totalRefunds -
     aggregation.totalChargebacks -
killedBy: Settlement Processor calculateNetAmount should calculate exact net amount subtracting fees only
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 950
Received: 1050

[Killed] BlockStatement
src/services/settlementProcessor.ts:96:20
 
 export function generateDailySettlement(
   aggregation: MerchantAggregation
-): DailySettlement {
-  const netAmount = calculateNetAmount(aggregation);
-
-  const chargebackRatio = calculateChargebackRatio(
-    aggregation.chargebackCount,
-    aggregation.approvedPaymentCount
-  );
-  const riskLevel = determineRiskLevel(chargebackRatio);
-
-  return {
-    merchantId: aggregation.merchantId,
-    grossAmount: aggregation.grossAmount,
-    totalFees: aggregation.totalFees,
-    totalRefunds: aggregation.totalRefunds,
-    totalChargebacks: aggregation.totalChargebacks,
-    totalPenalties: aggregation.totalPenalties,
-    netAmount,
-    riskLevel: riskLevel
-  };
-}
+): DailySettlement {}
 
 export function generateDailySettlements(
killedBy: Settlement Processor generateDailySettlement should return settlement with all required properties
statusReason: Error: expect(received).toHaveProperty(path)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/services/settlementProcessor.ts:121:22
   transactions: Transaction[],
   paymentFees: Map<string, number>,
   chargebackPenalties: Map<string, number>
-): DailySettlement[] {
-  const aggregations = groupTransactionsByMerchant(
-    transactions,
-    paymentFees,
-    chargebackPenalties
-  );
-
-  const settlements: DailySettlement[] = [];
-
-  aggregations.forEach(aggregation => {
-    const settlement = generateDailySettlement(aggregation);
-    settlements.push(settlement);
-  });
-
-  return settlements;
-}
+): DailySettlement[] {}
 
killedBy: Settlement Processor generateDailySettlements should return empty array for empty transactions
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/services/settlementProcessor.ts:130:39
 
   const settlements: DailySettlement[] = [];
 
-  aggregations.forEach(aggregation => {
-    const settlement = generateDailySettlement(aggregation);
-    settlements.push(settlement);
-  });
+  aggregations.forEach(aggregation => {});
 
   return settlements;
killedBy: Settlement Processor generateDailySettlements should generate settlement for single merchant
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
