[Killed] BlockStatement
src/services/volumeCalculator.ts:10:18
 
 export function calculateApprovedPaymentsVolume(
   transactions: Transaction[]
-): VolumeMetrics {
-  let totalVolume = 0;
-  let count = 0;
-
-  for (const transaction of transactions) {
-    if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
-    ) {
-      totalVolume += transaction.amount;
-      count += 1;
-    }
-  }
-
-  return {
-    totalApprovedPaymentsVolume: totalVolume,
-    totalApprovedPaymentsCount: count
-  };
-}
+): VolumeMetrics {}
 
 export function calculateVolumeByMerchant(
killedBy: Volume Calculator calculateApprovedPaymentsVolume should return zero volume and count for empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'totalApprovedPaymentsVolume')

[Killed] BlockStatement
src/services/volumeCalculator.ts:14:43
   let totalVolume = 0;
   let count = 0;
 
-  for (const transaction of transactions) {
-    if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
-    ) {
-      totalVolume += transaction.amount;
-      count += 1;
-    }
-  }
+  for (const transaction of transactions) {}
 
   return {
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ConditionalExpression
src/services/volumeCalculator.ts:16:7
 
   for (const transaction of transactions) {
     if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
+      false
     ) {
       totalVolume += transaction.amount;
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] LogicalOperator
src/services/volumeCalculator.ts:16:7
 
   for (const transaction of transactions) {
     if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
+      transaction.type === TransactionType.PAYMENT || transaction.status === TransactionStatus.APPROVED
     ) {
       totalVolume += transaction.amount;
killedBy: Volume Calculator calculateApprovedPaymentsVolume should ignore pending payments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 300

[Killed] EqualityOperator
src/services/volumeCalculator.ts:17:7
   for (const transaction of transactions) {
     if (
       transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
+      transaction.status !== TransactionStatus.APPROVED
     ) {
       totalVolume += transaction.amount;
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] ConditionalExpression
src/services/volumeCalculator.ts:17:7
   for (const transaction of transactions) {
     if (
       transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
+      true
     ) {
       totalVolume += transaction.amount;
killedBy: Volume Calculator calculateApprovedPaymentsVolume should ignore pending payments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 300

[Killed] BlockStatement
src/services/volumeCalculator.ts:18:7
     if (
       transaction.type === TransactionType.PAYMENT &&
       transaction.status === TransactionStatus.APPROVED
-    ) {
-      totalVolume += transaction.amount;
-      count += 1;
-    }
+    ) {}
   }
 
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0

[Killed] AssignmentOperator
src/services/volumeCalculator.ts:19:7
       transaction.type === TransactionType.PAYMENT &&
       transaction.status === TransactionStatus.APPROVED
     ) {
-      totalVolume += transaction.amount;
+      totalVolume -= transaction.amount;
       count += 1;
     }
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: -100

[Killed] AssignmentOperator
src/services/volumeCalculator.ts:20:7
       transaction.status === TransactionStatus.APPROVED
     ) {
       totalVolume += transaction.amount;
-      count += 1;
+      count -= 1;
     }
   }
killedBy: Volume Calculator calculateApprovedPaymentsVolume should calculate volume and count for single approved payment
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/services/volumeCalculator.ts:32:31
 
 export function calculateVolumeByMerchant(
   transactions: Transaction[]
-): Map<string, VolumeMetrics> {
-  const volumeByMerchant = new Map<string, VolumeMetrics>();
-
-  for (const transaction of transactions) {
-    if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
-    ) {
-      const current = volumeByMerchant.get(transaction.merchantId) || {
-        totalApprovedPaymentsVolume: 0,
-        totalApprovedPaymentsCount: 0
-      };
-
-      current.totalApprovedPaymentsVolume += transaction.amount;
-      current.totalApprovedPaymentsCount += 1;
-
-      volumeByMerchant.set(transaction.merchantId, current);
-    }
-  }
-
-  return volumeByMerchant;
-}
+): Map<string, VolumeMetrics> {}
 
killedBy: Volume Calculator calculateVolumeByMerchant should return empty map for empty array
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/services/volumeCalculator.ts:35:43
 ): Map<string, VolumeMetrics> {
   const volumeByMerchant = new Map<string, VolumeMetrics>();
 
-  for (const transaction of transactions) {
-    if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
-    ) {
-      const current = volumeByMerchant.get(transaction.merchantId) || {
-        totalApprovedPaymentsVolume: 0,
-        totalApprovedPaymentsCount: 0
-      };
-
-      current.totalApprovedPaymentsVolume += transaction.amount;
-      current.totalApprovedPaymentsCount += 1;
-
-      volumeByMerchant.set(transaction.merchantId, current);
-    }
-  }
+  for (const transaction of transactions) {}
 
   return volumeByMerchant;
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/services/volumeCalculator.ts:37:7
 
   for (const transaction of transactions) {
     if (
-      transaction.type === TransactionType.PAYMENT &&
-      transaction.status === TransactionStatus.APPROVED
+      true
     ) {
       const current = volumeByMerchant.get(transaction.merchantId) || {
killedBy: Volume Calculator calculateVolumeByMerchant should ignore pending payments
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "totalApprovedPaymentsCount": 1,
-   "totalApprovedPaymentsVolume": 100,

[Killed] BlockStatement
src/services/volumeCalculator.ts:39:7
     if (
       transaction.type === TransactionType.PAYMENT &&
       transaction.status === TransactionStatus.APPROVED
-    ) {
-      const current = volumeByMerchant.get(transaction.merchantId) || {
-        totalApprovedPaymentsVolume: 0,
-        totalApprovedPaymentsCount: 0
-      };
-
-      current.totalApprovedPaymentsVolume += transaction.amount;
-      current.totalApprovedPaymentsCount += 1;
-
-      volumeByMerchant.set(transaction.merchantId, current);
-    }
+    ) {}
   }
 
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/services/volumeCalculator.ts:40:23
       transaction.type === TransactionType.PAYMENT &&
       transaction.status === TransactionStatus.APPROVED
     ) {
-      const current = volumeByMerchant.get(transaction.merchantId) || {
-        totalApprovedPaymentsVolume: 0,
-        totalApprovedPaymentsCount: 0
-      };
+      const current = volumeByMerchant.get(transaction.merchantId) && {
+  totalApprovedPaymentsVolume: 0,
+  totalApprovedPaymentsCount: 0
+};
 
       current.totalApprovedPaymentsVolume += transaction.amount;
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: TypeError: Cannot read properties of undefined (reading 'totalApprovedPaymentsVolume')

[Killed] ConditionalExpression
src/services/volumeCalculator.ts:40:23
       transaction.type === TransactionType.PAYMENT &&
       transaction.status === TransactionStatus.APPROVED
     ) {
-      const current = volumeByMerchant.get(transaction.merchantId) || {
-        totalApprovedPaymentsVolume: 0,
-        totalApprovedPaymentsCount: 0
-      };
+      const current = true;
 
       current.totalApprovedPaymentsVolume += transaction.amount;
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: TypeError: Cannot create property 'totalApprovedPaymentsVolume' on boolean 'true'

[Killed] AssignmentOperator
src/services/volumeCalculator.ts:45:7
         totalApprovedPaymentsCount: 0
       };
 
-      current.totalApprovedPaymentsVolume += transaction.amount;
+      current.totalApprovedPaymentsVolume -= transaction.amount;
       current.totalApprovedPaymentsCount += 1;
 
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "totalApprovedPaymentsCount": 1,
-   "totalApprovedPaymentsVolume": 100,

[Killed] AssignmentOperator
src/services/volumeCalculator.ts:46:7
       };
 
       current.totalApprovedPaymentsVolume += transaction.amount;
-      current.totalApprovedPaymentsCount += 1;
+      current.totalApprovedPaymentsCount -= 1;
 
       volumeByMerchant.set(transaction.merchantId, current);
killedBy: Volume Calculator calculateVolumeByMerchant should calculate volume for single merchant with single transaction
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "totalApprovedPaymentsCount": 1,
+   "totalApprovedPaymentsCount": -1,
