[Killed] BlockStatement
src/settlement.ts:7:60
 import { Transaction } from './models';
 import sampleData from '../data/sample-transactions.json';
 
-function convertToTransactions(data: any[]): Transaction[] {
-  return data.map(item => ({
-    ...item,
-    createdAt: new Date(item.createdAt)
-  }));
-}
+function convertToTransactions(data: any[]): Transaction[] {}
 
 export function runDailySettlement(): void {
killedBy: settlement.ts runDailySettlement should process transactions and log header
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/settlement.ts:8:19
 import sampleData from '../data/sample-transactions.json';
 
 function convertToTransactions(data: any[]): Transaction[] {
-  return data.map(item => ({
-    ...item,
-    createdAt: new Date(item.createdAt)
-  }));
+  return data.map(() => undefined);
 }
 
killedBy: settlement.ts runDailySettlement should process transactions and log header
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
src/settlement.ts:15:15
 }
 
 export function runDailySettlement(): void {
-  console.log('='.repeat(80));
+  console.log("".repeat(80));
   console.log('DAILY SETTLEMENT PROCESSOR');
   console.log('='.repeat(80));
killedBy: settlement.ts string literal mutations should verify all header separators use equals character
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "================================================================================"
Received: ""

[Killed] StringLiteral
src/settlement.ts:17:15
 export function runDailySettlement(): void {
   console.log('='.repeat(80));
   console.log('DAILY SETTLEMENT PROCESSOR');
-  console.log('='.repeat(80));
+  console.log("".repeat(80));
 
   const processor = new DailySettlementProcessor();
killedBy: settlement.ts string literal mutations should verify all header separators use equals character
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "================================================================================"
Received: ""

[Killed] StringLiteral
src/settlement.ts:22:15
   const processor = new DailySettlementProcessor();
   const transactions = convertToTransactions(sampleData.transactions);
 
-  console.log(`\n📥 Entrada: ${transactions.length} transações`);
+  console.log(``;
   console.log('\nTipos de transações:');
   const types = new Map<string, number>();
killedBy: settlement.ts runDailySettlement should log the number of input transactions
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "📥 Entrada:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:23:15
   const transactions = convertToTransactions(sampleData.transactions);
 
   console.log(`\n📥 Entrada: ${transactions.length} transações`);
-  console.log('\nTipos de transações:');
+  console.log("");
   const types = new Map<string, number>();
   transactions.forEach(t => {
killedBy: settlement.ts runDailySettlement should log transaction types with counts
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "
Tipos de transações:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] BlockStatement
src/settlement.ts:25:29
   console.log(`\n📥 Entrada: ${transactions.length} transações`);
   console.log('\nTipos de transações:');
   const types = new Map<string, number>();
-  transactions.forEach(t => {
-    types.set(t.type, (types.get(t.type) || 0) + 1);
-  });
+  transactions.forEach(t => {});
   types.forEach((count, type) => {
     console.log(`   - ${type}: ${count}`);
killedBy: settlement.ts runDailySettlement should log transaction types with counts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/settlement.ts:26:23
   console.log('\nTipos de transações:');
   const types = new Map<string, number>();
   transactions.forEach(t => {
-    types.set(t.type, (types.get(t.type) || 0) + 1);
+    types.set(t.type, (types.get(t.type) || 0) - 1);
   });
   types.forEach((count, type) => {
killedBy: settlement.ts runDailySettlement should log transaction types with counts
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
src/settlement.ts:26:24
   console.log('\nTipos de transações:');
   const types = new Map<string, number>();
   transactions.forEach(t => {
-    types.set(t.type, (types.get(t.type) || 0) + 1);
+    types.set(t.type, (true) + 1);
   });
   types.forEach((count, type) => {
killedBy: settlement.ts string literal mutations should count payment transactions correctly (not using subtraction)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 35
Received: 2

[Killed] BlockStatement
src/settlement.ts:28:34
   transactions.forEach(t => {
     types.set(t.type, (types.get(t.type) || 0) + 1);
   });
-  types.forEach((count, type) => {
-    console.log(`   - ${type}: ${count}`);
-  });
+  types.forEach((count, type) => {});
 
   console.log('\n⏳ Processando...');
killedBy: settlement.ts runDailySettlement should log transaction types with counts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/settlement.ts:29:17
     types.set(t.type, (types.get(t.type) || 0) + 1);
   });
   types.forEach((count, type) => {
-    console.log(`   - ${type}: ${count}`);
+    console.log(``);
   });
 
killedBy: settlement.ts runDailySettlement should log transaction types with counts
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/settlement.ts:36:22
   const settlements = processor.process(transactions);
 
   console.log(`\n✅ Saída: ${settlements.length} merchant(s) consolidado(s)`);
-  console.log('\n' + '='.repeat(80));
+  console.log('\n' + "".repeat(80));
   console.log('CONSOLIDAÇÃO POR MERCHANT');
   console.log('='.repeat(80));
killedBy: settlement.ts string literal mutations should verify consolidation section separators use equals character
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ↵
- ================================================================================
+

[Killed] BlockStatement
src/settlement.ts:40:37
   console.log('CONSOLIDAÇÃO POR MERCHANT');
   console.log('='.repeat(80));
 
-  settlements.forEach(settlement => {
-    console.log(`\n📊 Merchant: ${settlement.merchantId}`);
-    console.log(`   Gross Amount:        $${settlement.grossAmount.toFixed(2)}`);
-    console.log(`   Total Fees:          $${settlement.totalFees.toFixed(2)}`);
-    console.log(`   Total Refunds:       $${settlement.totalRefunds.toFixed(2)}`);
-    console.log(`   Total Chargebacks:   $${settlement.totalChargebacks.toFixed(2)}`);
-    console.log(`   Total Penalties:     $${settlement.totalPenalties.toFixed(2)}`);
-    console.log('   ' + '-'.repeat(50));
-    console.log(`   Net Amount:          $${settlement.netAmount.toFixed(2)}`);
-    console.log(`   Risk Level:          ${settlement.riskLevel}`);
-  });
+  settlements.forEach(settlement => {});
 
   console.log('\n' + '='.repeat(80));
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "📊 Merchant: M001"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:41:17
   console.log('='.repeat(80));
 
   settlements.forEach(settlement => {
-    console.log(`\n📊 Merchant: ${settlement.merchantId}`);
+    console.log(``;
     console.log(`   Gross Amount:        $${settlement.grossAmount.toFixed(2)}`);
     console.log(`   Total Fees:          $${settlement.totalFees.toFixed(2)}`);
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "📊 Merchant: M001"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:43:17
   settlements.forEach(settlement => {
     console.log(`\n📊 Merchant: ${settlement.merchantId}`);
     console.log(`   Gross Amount:        $${settlement.grossAmount.toFixed(2)}`);
-    console.log(`   Total Fees:          $${settlement.totalFees.toFixed(2)}`);
+    console.log(``);
     console.log(`   Total Refunds:       $${settlement.totalRefunds.toFixed(2)}`);
     console.log(`   Total Chargebacks:   $${settlement.totalChargebacks.toFixed(2)}`);
killedBy: settlement.ts string literal mutations should log exact field labels with whitespace
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "   Total Fees:          $78.90"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:45:17
     console.log(`   Gross Amount:        $${settlement.grossAmount.toFixed(2)}`);
     console.log(`   Total Fees:          $${settlement.totalFees.toFixed(2)}`);
     console.log(`   Total Refunds:       $${settlement.totalRefunds.toFixed(2)}`);
-    console.log(`   Total Chargebacks:   $${settlement.totalChargebacks.toFixed(2)}`);
+    console.log(``);
     console.log(`   Total Penalties:     $${settlement.totalPenalties.toFixed(2)}`);
     console.log('   ' + '-'.repeat(50));
killedBy: settlement.ts string literal mutations should log exact field labels with whitespace
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "   Total Chargebacks:   $50.55"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:48:17
     console.log(`   Total Chargebacks:   $${settlement.totalChargebacks.toFixed(2)}`);
     console.log(`   Total Penalties:     $${settlement.totalPenalties.toFixed(2)}`);
     console.log('   ' + '-'.repeat(50));
-    console.log(`   Net Amount:          $${settlement.netAmount.toFixed(2)}`);
+    console.log(``);
     console.log(`   Risk Level:          ${settlement.riskLevel}`);
   });
killedBy: settlement.ts string literal mutations should log exact field labels with whitespace
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "   Net Amount:          $979.75"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:54:15
 
   console.log('\n' + '='.repeat(80));
   console.log('RESUMO FINAL');
-  console.log('='.repeat(80));
+  console.log("".repeat(80));
 
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
killedBy: settlement.ts string literal mutations should verify summary section separators use equals character
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "================================================================================"
Received: ""

[Killed] ArrowFunction
src/settlement.ts:56:47
   console.log('RESUMO FINAL');
   console.log('='.repeat(80));
 
-  const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
+  const totalGrossAmount = settlements.reduce(() => undefined, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/settlement.ts:56:59
   console.log('RESUMO FINAL');
   console.log('='.repeat(80));
 
-  const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
+  const totalGrossAmount = settlements.reduce((sum, s) => sum - s.grossAmount, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$3000.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] ArrowFunction
src/settlement.ts:57:45
   console.log('='.repeat(80));
 
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
-  const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
+  const totalNetAmount = settlements.reduce(() => undefined, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/settlement.ts:57:57
   console.log('='.repeat(80));
 
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
-  const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
+  const totalNetAmount = settlements.reduce((sum, s) => sum - s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$2400.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] ArrowFunction
src/settlement.ts:58:40
 
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
-  const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
+  const totalFees = settlements.reduce(() => undefined, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/settlement.ts:58:52
 
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
-  const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
+  const totalFees = settlements.reduce((sum, s) => sum - s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$150.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] ArithmeticOperator
src/settlement.ts:59:55
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
-  const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
+  const totalRefunds = settlements.reduce((sum, s) => sum - s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$300.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] ArrowFunction
src/settlement.ts:59:43
   const totalGrossAmount = settlements.reduce((sum, s) => sum + s.grossAmount, 0);
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
-  const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
+  const totalRefunds = settlements.reduce(() => undefined, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArrowFunction
src/settlement.ts:60:47
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
-  const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
+  const totalChargebacks = settlements.reduce(() => undefined, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/settlement.ts:60:59
   const totalNetAmount = settlements.reduce((sum, s) => sum + s.netAmount, 0);
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
-  const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
+  const totalChargebacks = settlements.reduce((sum, s) => sum - s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$90.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] ArrowFunction
src/settlement.ts:61:45
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
-  const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
+  const totalPenalties = settlements.reduce(() => undefined, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
killedBy: settlement.ts runDailySettlement should log settlement details for each merchant
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/settlement.ts:61:57
   const totalFees = settlements.reduce((sum, s) => sum + s.totalFees, 0);
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
-  const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
+  const totalPenalties = settlements.reduce((sum, s) => sum - s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
killedBy: settlement.ts string literal mutations should verify total penalties calculation is addition
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] EqualityOperator
src/settlement.ts:62:53
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
-  const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
+  const highRiskMerchants = settlements.filter(s => s.riskLevel !== 'HIGH').length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
   const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
killedBy: settlement.ts runDailySettlement should handle multiple HIGH risk merchants in summary
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "2"
Received string:    "  HIGH Risk:             0"

[Killed] ConditionalExpression
src/settlement.ts:62:53
   const totalRefunds = settlements.reduce((sum, s) => sum + s.totalRefunds, 0);
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
-  const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
+  const highRiskMerchants = settlements.filter(s => true).length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
   const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
killedBy: settlement.ts string literal mutations should filter HIGH risk merchants correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "1"
Received string:    "  HIGH Risk:             2"

[Killed] ConditionalExpression
src/settlement.ts:63:55
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
-  const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
+  const mediumRiskMerchants = settlements.filter(s => true).length;
   const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
 
killedBy: settlement.ts string literal mutations should filter MEDIUM risk merchants correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "1"
Received string:    "  MEDIUM Risk:           3"

[Killed] MethodExpression
src/settlement.ts:63:31
   const totalChargebacks = settlements.reduce((sum, s) => sum + s.totalChargebacks, 0);
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
-  const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
+  const mediumRiskMerchants = settlements.length;
   const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
 
killedBy: settlement.ts string literal mutations should filter MEDIUM risk merchants correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "1"
Received string:    "  MEDIUM Risk:           3"

[Killed] ArrowFunction
src/settlement.ts:64:47
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
-  const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
+  const lowRiskMerchants = settlements.filter(() => undefined).length;
 
   console.log(`\nTotal Merchants:         ${settlements.length}`);
killedBy: settlement.ts runDailySettlement should count risk levels correctly when all are same level
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "2"
Received string:    "  LOW Risk:              0"

[Killed] ConditionalExpression
src/settlement.ts:64:52
   const totalPenalties = settlements.reduce((sum, s) => sum + s.totalPenalties, 0);
   const highRiskMerchants = settlements.filter(s => s.riskLevel === 'HIGH').length;
   const mediumRiskMerchants = settlements.filter(s => s.riskLevel === 'MEDIUM').length;
-  const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
+  const lowRiskMerchants = settlements.filter(s => true).length;
 
   console.log(`\nTotal Merchants:         ${settlements.length}`);
killedBy: settlement.ts string literal mutations should filter LOW risk merchants correctly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "1"
Received string:    "  LOW Risk:              2"

[Killed] StringLiteral
src/settlement.ts:67:15
   const lowRiskMerchants = settlements.filter(s => s.riskLevel === 'LOW').length;
 
   console.log(`\nTotal Merchants:         ${settlements.length}`);
-  console.log(`\nFinancial Summary:`);
+  console.log(``);
   console.log(`  Total Gross Amount:    $${totalGrossAmount.toFixed(2)}`);
   console.log(`  Total Fees:            $${totalFees.toFixed(2)}`);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Financial Summary:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:69:15
   console.log(`\nTotal Merchants:         ${settlements.length}`);
   console.log(`\nFinancial Summary:`);
   console.log(`  Total Gross Amount:    $${totalGrossAmount.toFixed(2)}`);
-  console.log(`  Total Fees:            $${totalFees.toFixed(2)}`);
+  console.log(``);
   console.log(`  Total Refunds:         $${totalRefunds.toFixed(2)}`);
   console.log(`  Total Chargebacks:     $${totalChargebacks.toFixed(2)}`);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$150.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:71:15
   console.log(`  Total Gross Amount:    $${totalGrossAmount.toFixed(2)}`);
   console.log(`  Total Fees:            $${totalFees.toFixed(2)}`);
   console.log(`  Total Refunds:         $${totalRefunds.toFixed(2)}`);
-  console.log(`  Total Chargebacks:     $${totalChargebacks.toFixed(2)}`);
+  console.log(``);
   console.log(`  Total Penalties:       $${totalPenalties.toFixed(2)}`);
   console.log(`  Total Net Amount:      $${totalNetAmount.toFixed(2)}`);
killedBy: settlement.ts runDailySettlement should log correct financial summary totals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "$90.00"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"
