[Killed] StringLiteral
src/settlement.ts:75:15
   console.log(`  Total Penalties:       $${totalPenalties.toFixed(2)}`);
   console.log(`  Total Net Amount:      $${totalNetAmount.toFixed(2)}`);
   
-  console.log(`\nRisk Distribution:`);
+  console.log(``);
   console.log(`  HIGH Risk:             ${highRiskMerchants}`);
   console.log(`  MEDIUM Risk:           ${mediumRiskMerchants}`);
killedBy: settlement.ts runDailySettlement should log risk distribution with HIGH risk merchants
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Risk Distribution:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:76:15
   console.log(`  Total Net Amount:      $${totalNetAmount.toFixed(2)}`);
   
   console.log(`\nRisk Distribution:`);
-  console.log(`  HIGH Risk:             ${highRiskMerchants}`);
+  console.log(``);
   console.log(`  MEDIUM Risk:           ${mediumRiskMerchants}`);
   console.log(`  LOW Risk:              ${lowRiskMerchants}`);
killedBy: settlement.ts runDailySettlement should log risk distribution with HIGH risk merchants
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "HIGH Risk:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:78:15
   console.log(`\nRisk Distribution:`);
   console.log(`  HIGH Risk:             ${highRiskMerchants}`);
   console.log(`  MEDIUM Risk:           ${mediumRiskMerchants}`);
-  console.log(`  LOW Risk:              ${lowRiskMerchants}`);
+  console.log(``);
 
   console.log('\n' + '='.repeat(80));
killedBy: settlement.ts runDailySettlement should log risk distribution with LOW risk merchants
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "LOW Risk:"
Received
       1: "================================================================================"
       2: "DAILY SETTLEMENT PROCESSOR"
       3: "================================================================================"

[Killed] StringLiteral
src/settlement.ts:80:15
   console.log(`  MEDIUM Risk:           ${mediumRiskMerchants}`);
   console.log(`  LOW Risk:              ${lowRiskMerchants}`);
 
-  console.log('\n' + '='.repeat(80));
+  console.log("" + '='.repeat(80));
 }
 
killedBy: settlement.ts string literal mutations should verify final separator uses newline and equals character
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 0

-
  ================================================================================

[Survived] BlockStatement
src/settlement.ts:83:30
   console.log('\n' + '='.repeat(80));
 }
 
-if (require.main === module) {
-  runDailySettlement();
-}
+if (require.main === module) {}
 

[Survived] ConditionalExpression
src/settlement.ts:83:5
   console.log('\n' + '='.repeat(80));
 }
 
-if (require.main === module) {
+if (false) {
   runDailySettlement();
 }
