[Killed] ConditionalExpression
src/domain/validations.ts:11:7
 }
 
 export function validateAmountNotNegative(amount: number): void {
-  if (amount < 0) {
+  if (true) {
     throw new ValidationError('Transaction amount cannot be negative');
   }
killedBy: Validations validateAmountNotNegative should not throw error when amount is zero
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Transaction amount cannot be negative"

      68 |       } else {
      69 |         stryCov_9fa48("10");
    > 70 |         throw new ValidationError(stryMutAct_9fa48("11") ? "" : (stryCov_9fa48("11"), 'Transaction amount cannot be negative'));

[Killed] BooleanLiteral
src/domain/validations.ts:17:7
 }
 
 export function validateDate(date: Date): void {
-  if (!(date instanceof Date) || isNaN(date.getTime())) {
+  if (date instanceof Date || isNaN(date.getTime())) {
     throw new ValidationError('Invalid date format');
   }
killedBy: Validations validateDate should throw error when date is not a Date object
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "date.getTime is not a function"

      78 |   } else {

[Killed] ConditionalExpression
src/domain/validations.ts:17:7
 }
 
 export function validateDate(date: Date): void {
-  if (!(date instanceof Date) || isNaN(date.getTime())) {
+  if (true) {
     throw new ValidationError('Invalid date format');
   }
killedBy: Validations validateDate should not throw error when date is valid
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Invalid date format"

      83 |       } else {
      84 |         stryCov_9fa48("17");
    > 85 |         throw new ValidationError(stryMutAct_9fa48("18") ? "" : (stryCov_9fa48("18"), 'Invalid date format'));

[Killed] ConditionalExpression
src/domain/validations.ts:26:7
   refund: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!refund.originalTransactionId) {
+  if (false) {
     throw new ValidationError('Refund must have an originalTransactionId');
   }
killedBy: Validations validateRefundHasValidPayment should throw error when refund has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must have an originalTransactionId"
Received message:   "Refund references non-existent payment: undefined"

      107 |       } else {
      108 |         stryCov_9fa48("28");
    > 109 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${refund.orig

[Killed] StringLiteral
src/domain/validations.ts:27:31
   payments: Map<string, Transaction>
 ): void {
   if (!refund.originalTransactionId) {
-    throw new ValidationError('Refund must have an originalTransactionId');
+    throw new ValidationError("");
   }
 
killedBy: Validations validateRefundHasValidPayment should throw error when refund has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund must have an originalTransactionId"
Received message:   ""

       98 |       } else {
       99 |         stryCov_9fa48("23");
    > 100 |         throw new ValidationError(stryMutAct_9fa48("24") ? "" : (stryCov_9fa48("24"), 'Refund must have an originalTransactionId'));

[Killed] BlockStatement
src/domain/validations.ts:32:29
 
   const originalTransaction = payments.get(refund.originalTransactionId);
 
-  if (!originalTransaction) {
-    throw new ValidationError(
-      `Refund references non-existent payment: ${refund.originalTransactionId}`
-    );
-  }
+  if (!originalTransaction) {}
 
   if (originalTransaction.type !== TransactionType.PAYMENT) {
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-existent payment
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'type')"

      110 |       }

[Killed] StringLiteral
src/domain/validations.ts:34:7
 
   if (!originalTransaction) {
     throw new ValidationError(
-      `Refund references non-existent payment: ${refund.originalTransactionId}`
+      ``
     );
   }
killedBy: Validations validateRefundHasValidPayment should throw error when refund references non-existent payment
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Refund references non-existent payment: non-existent"
Received message:   ""

      107 |       } else {
      108 |         stryCov_9fa48("28");
    > 109 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${refund.originalTransactionId}`));

[Killed] BlockStatement
src/domain/validations.ts:49:42
   chargeback: Transaction,
   payments: Map<string, Transaction>
 ): void {
-  if (!chargeback.originalTransactionId) {
-    throw new ValidationError('Chargeback must have an originalTransactionId');
-  }
+  if (!chargeback.originalTransactionId) {}
 
   const originalTransaction = payments.get(chargeback.originalTransactionId);
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback has no originalTransactionId
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback must have an originalTransactionId"
Received message:   "Chargeback references non-existent payment: undefined"

      139 |       } else {
      140 |         stryCov_9fa48("44");
    > 141 |         throw new ValidationError(stryMutAct_9fa48("45") ? `` : (stryCov_9fa48("45"), `Chargeback references non-existent payment: $

[Survived] StringLiteral
src/domain/validations.ts:63:7
 
   if (originalTransaction.type !== TransactionType.PAYMENT) {
     throw new ValidationError(
-      `Chargeback must reference a payment, not ${originalTransaction.type}`
+      ``
     );
   }

[Killed] EqualityOperator
src/domain/validations.ts:67:7
     );
   }
 
-  if (originalTransaction.status !== TransactionStatus.APPROVED) {
+  if (originalTransaction.status === TransactionStatus.APPROVED) {
     throw new ValidationError(
       `Chargeback must reference an approved payment, got: ${originalTransaction.status}`
killedBy: Validations validateChargebackHasValidApprovedPayment should throw error when chargeback references pending payment
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:78:7
   chargebackReversed: Transaction,
   allTransactions: Map<string, Transaction>
 ): void {
-  if (!chargebackReversed.originalTransactionId) {
+  if (true) {
     throw new ValidationError('ChargebackReversed must have an originalTransactionId');
   }
killedBy: Validations validateTransaction should throw error when chargebackReversed references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "ChargebackReversed must reference a chargeback, not payment"
Received message:   "ChargebackReversed must have an originalTransactionId"

      170 |       } else {
      171 |         stryCov_9fa48("60");
    > 172 |         throw new ValidationError(stryMutAct_9fa48("61") ? "" : (stryCov_9fa48("61"), 'ChargebackReversed must have an

[Survived] StringLiteral
src/domain/validations.ts:79:31
   allTransactions: Map<string, Transaction>
 ): void {
   if (!chargebackReversed.originalTransactionId) {
-    throw new ValidationError('ChargebackReversed must have an originalTransactionId');
+    throw new ValidationError("");
   }
 

[Killed] ConditionalExpression
src/domain/validations.ts:90:7
     );
   }
 
-  if (originalTransaction.type !== TransactionType.CHARGEBACK) {
+  if (false) {
     throw new ValidationError(
       `ChargebackReversed must reference a chargeback, not ${originalTransaction.type}`
killedBy: Validations validateTransaction should throw error when chargebackReversed references non-payment transaction
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:101:7
   refundAmount: number,
   originalAmount: number
 ): void {
-  if (refundAmount > originalAmount) {
+  if (false) {
     throw new ValidationError(
       `Refund amount (${refundAmount}) cannot exceed original payment amount (${originalAmount})`
killedBy: Validations validateRefundNotExceedsOriginal should throw error when refund exceeds original amount
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] EqualityOperator
src/domain/validations.ts:101:7
   refundAmount: number,
   originalAmount: number
 ): void {
-  if (refundAmount > originalAmount) {
+  if (refundAmount >= originalAmount) {
     throw new ValidationError(
       `Refund amount (${refundAmount}) cannot exceed original payment amount (${originalAmount})`
killedBy: Validations validateRefundNotExceedsOriginal should not throw error when refund equals original amount
statusReason: Error: expect(received).not.toThrow()

Error name:    "ValidationError"
Error message: "Refund amount (100) cannot exceed original payment amount (100)"

      202 |       } else {
      203 |         stryCov_9fa48("77");
    > 204 |         throw new ValidationError(stryMutAct_9fa48("78") ? `` : (stryCov_9fa48("78"), `Refund amount (${refundAmount}) cannot exceed original payment amount (${origin

[Killed] ConditionalExpression
src/domain/validations.ts:118:9
   validateDate(transaction.createdAt);
 
   if (allPayments) {
-    if (transaction.type === TransactionType.REFUND) {
+    if (true) {
       validateRefundHasValidPayment(transaction, allPayments);
     }
killedBy: Validations validateTransaction should validate chargeback with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chargeback references non-existent payment"
Received message:   "Refund references non-existent payment: non-existent"

      107 |       } else {
      108 |         stryCov_9fa48("28");
    > 109 |         throw new ValidationError(stryMutAct_9fa48("29") ? `` : (stryCov_9fa48("29"), `Refund references non-existent payment: ${refund.

[Killed] ConditionalExpression
src/domain/validations.ts:122:9
       validateRefundHasValidPayment(transaction, allPayments);
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK) {
+    if (false) {
       validateChargebackHasValidApprovedPayment(transaction, allPayments);
     }
killedBy: Validations validateTransaction should validate chargeback with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw

[Killed] ConditionalExpression
src/domain/validations.ts:127:7
     }
   }
 
-  if (allTransactions && transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+  if (false) {
     validateChargebackReversedHasValidChargeback(transaction, allTransactions);
   }
killedBy: Validations validateTransaction should validate chargebackReversed with payment references
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: ValidationError

Received function did not throw
