[Survived] ConditionalExpression
src/processor.ts:55:13
     for (const transaction of validatedTransactions) {
       if (transaction.type === TransactionType.REFUND && transaction.originalTransactionId) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);
-        if (originalPayment) {
+        if (true) {
           const originalFee = paymentFees.get(transaction.originalTransactionId) || 0;
           const processed = processRefund(transaction, originalPayment, originalFee);

[Survived] LogicalOperator
src/processor.ts:66:9
 
     for (const transaction of validatedTransactions) {
       if (
-        transaction.type === TransactionType.CHARGEBACK &&
-        transaction.originalTransactionId
+        transaction.type === TransactionType.CHARGEBACK || transaction.originalTransactionId
       ) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);

[Survived] ConditionalExpression
src/processor.ts:66:9
 
     for (const transaction of validatedTransactions) {
       if (
-        transaction.type === TransactionType.CHARGEBACK &&
-        transaction.originalTransactionId
+        true
       ) {
         const originalPayment = paymentMap.get(transaction.originalTransactionId);

[Survived] EqualityOperator
src/processor.ts:113:11
       );
 
       const ratioPenalty = calculateHighChargebackRatioPenalty(chargebackRatio);
-      if (ratioPenalty > 0) {
+      if (ratioPenalty >= 0) {
         merchantRiskPenalties.set(merchantId, ratioPenalty);
       }
