[Killed] ObjectLiteral
src/services/chargebackProcessor.ts:48:10
   const penaltyRemoved = roundToTwoDecimals(originalChargebackPenalty);
   const totalReversed = roundToTwoDecimals(chargebackAmountReversed + penaltyRemoved);
 
-  return {
-    chargebackReversedTransactionId: chargebackReversedTransaction.id,
-    originalChargebackId: chargebackReversedTransaction.originalTransactionId || '',
-    chargebackAmountReversed,
-    penaltyRemoved,
-    totalReversed
-  };
+  return {};
 }
 
killedBy: Chargeback Processor processChargebackReversed should return ProcessedChargebackReversed object
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "chargebackReversedTransactionId"
Received path: []

Received value: {}

[Survived] LogicalOperator
src/services/chargebackProcessor.ts:50:27
 
   return {
     chargebackReversedTransactionId: chargebackReversedTransaction.id,
-    originalChargebackId: chargebackReversedTransaction.originalTransactionId || '',
+    originalChargebackId: chargebackReversedTransaction.originalTransactionId && '',
     chargebackAmountReversed,
     penaltyRemoved,
