[Killed] BlockStatement
src/services/paymentProcessor.ts:17:44
 }
 
 export function calculateFeeRate(totalVolume: number): number {
-  if (totalVolume > HIGH_VOLUME_THRESHOLD) {
-    return HIGH_VOLUME_PAYMENT_FEE_RATE;
-  }
+  if (totalVolume > HIGH_VOLUME_THRESHOLD) {}
   return DEFAULT_PAYMENT_FEE_RATE;
 }
killedBy: Payment Processor calculateFeeRate should return different rate for high volume
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not 0.05

[Killed] ConditionalExpression
src/services/paymentProcessor.ts:37:7
   transaction: Transaction,
   totalApprovedPaymentsVolume: number
 ): ProcessedPayment {
-  if (transaction.status !== TransactionStatus.APPROVED) {
+  if (true) {
     throw new Error(`Cannot process non-approved payment with status: ${transaction.status}`);
   }
killedBy: Payment Processor processApprovedPayment should not throw error for approved payment
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Cannot process non-approved payment with status: approved"

       98 |       } else {
       99 |         stryCov_9fa48("206");
    > 100 |         throw new Error(stryMutAct_9fa48("207") ? `` : (stryCov_9fa48("207"), `Cannot process non-approved payment with status: ${transaction.status}`));
