[Killed] EqualityOperator
src/services/refundProcessor.ts:27:10
   paymentDate: Date
 ): boolean {
   const daysDifference = calculateDaysDifference(refundDate, paymentDate);
-  return daysDifference <= REFUND_FULL_WINDOW_DAYS;
+  return daysDifference > REFUND_FULL_WINDOW_DAYS;
 }
 
killedBy: Refund Processor isWithinFullRefundWindow should return true for refund on same day
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/services/refundProcessor.ts:35:7
   originalPayment: Transaction,
   originalPaymentFee: number
 ): ProcessedRefund {
-  if (refundTransaction.amount > originalPayment.amount) {
+  if (true) {
     throw new Error(
       `Refund amount (${refundTransaction.amount}) cannot exceed original payment amount (${originalPayment.amount})`
killedBy: Refund Processor processRefund should not throw error for valid refund within window
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Refund amount (50) cannot exceed original payment amount (100)"

      85 |       } else {
      86 |         stryCov_9fa48("225");
    > 87 |         throw new Error(stryMutAct_9fa48("226") ? `` : (stryCov_9fa48("226"), `Refund amount (${refundTransaction.amount}) cannot exceed original payment amount (${originalPayment
