[Killed] ConditionalExpression
src/services/riskManager.ts:57:7
 export function calculateHighChargebackRatioPenalty(
   chargebackRatio: number
 ): number {
-  if (chargebackRatio > CHARGEBACK_RATIO_HIGH_THRESHOLD) {
+  if (false) {
     return roundToTwoDecimals(HIGH_CHARGEBACK_RATIO_PENALTY);
   }
killedBy: Risk Manager calculateHighChargebackRatioPenalty should return positive penalty for high ratio
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
