[Killed] EqualityOperator
src/services/settlementProcessor.ts:63:9
       aggregation.totalPenalties += penalty;
     }
 
-    if (transaction.type === TransactionType.CHARGEBACK_REVERSED) {
+    if (transaction.type !== TransactionType.CHARGEBACK_REVERSED) {
       aggregation.totalChargebacks -= transaction.amount;
       aggregation.chargebackCount = Math.max(0, aggregation.chargebackCount - 1);
killedBy: Settlement Processor groupTransactionsByMerchant should handle chargebacks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 0
