[Survived] ConditionalExpression
src/settlement.ts:83:5
   console.log('\n' + '='.repeat(80));
 }
 
-if (require.main === module) {
+if (true) {
   runDailySettlement();
 }

[Survived] EqualityOperator
src/settlement.ts:83:5
   console.log('\n' + '='.repeat(80));
 }
 
-if (require.main === module) {
+if (require.main !== module) {
   runDailySettlement();
 }
